<?

$atext[840]='<b>Аура Ярости</b> - Пассивная аура, время действия ежедневно с 21:00 до 09:00. Повышает вероятность нанесения травмы с критового удара на 10%.';;
$atext[841]='<b>Аура Ночи</b> - Пассивная аура, время действия ежедневно с 21:00 до 09:00. Поднимает шанс прокусывания чеснока на 10%.';
$atext[842]='<b>Аура Защиты</b> - Пассивная аура, время действия ежедневно с 21:00 до 09:00. Уменьшает время полученных травм на 10%, увеличивает скорость восстановления НР и маны на 20%';; 
$atext[704]='<b>Темное Разрушение</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды. В случае поражения, персонаж получает поломку всех вещей на 1-2 единицы рандомно. На одного персонажа можно использовать только 1 раз за бой.';
$atext[726]='<b>Гнев Ангела</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды. В случае поражения, персонаж получает поломку всех вещей на 1-2 единицы рандомно. На одного персонажа можно использовать только 1 раз за бой.';
$atext[727]='<b>Порча</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды. В случае поражения, персонаж получает поломку всех вещей на 1-2 единицы рандомно. На одного персонажа можно использовать только 1 раз за бой.';
$atext[728]='<b>Иммунитет</b> - 5 штук в сутки - Дает защиту на 20 минут от воздействия любых боевых абилити. Сам персонаж при этом может использовать свои абилити. Можно использовать только на себя.';
$atext[701]='<b>Жажда Крови</b> - 10 штук в сутки - Увеличивает наносимый урон на 10 единиц в последующих 5ти разменах. Можно использовать только на себя 1 раз за бой.';
$atext[702]='<b>Темный Щит</b> - 10 штук в сутки - Снижает получаемый урон на 10 единиц в последующих 5ти разменах. Можно использовать только на себя 1 раз за бой.';
$atext[707]='<b>Темный Ритуал</b> - 3 штуки в сутки - Повышает каждому из троих использовавших МФ на 1%, урон на 10 единиц, броню на 10 единиц на 5 последующих разменов.';
$atext[828]='<b>Темный Вызов</b> - 3 штуки в сутки - Призывает в бой Демона Тьмы, уровень которого определяется средним (арифметическим) уровнем из троих вызвавших его персонажей.';
$atext[808]='<b>Темное Проклятие</b> - 3 штуки в сутки - Снимает с одного выбранного соперника % от текущего НР, равный сумме уровней троих использовавших. Выбор всех троих использовавших должен быть одинаков. На одного персонажа можно использовать только 1 раз за бой.';
$atext[825]='<b>Вампиризм</b> - время действия ежедневно с 21:00 до 09:00. Дает возможность укусить серого или нейтрального персонажа. В Ночь Полнолуния можно кусать дополнительно светлых персонажей и паладинов. При удачном укусе вампир получает все НР жертвы, а у жертвы остается 1 НР. Используется только вне боя.<br>Кусать можно персонажей не ниже 4 уровня и не выше вампира по уровню. Для укуса у вампира должны быть желтые НР, а у жертвы желтые или зеленые НР.<br>При неудачном укусе (если у жертвы в рюкзаке есть Чеснок, который сработал), у вампира становится 1НР, а у жертвы НР не изменяются.<br>При неудачном укусе (если у жертвы в рюкзаке есть Осиновый кол, который сработал), начинается кровавый бой между вампиром и жертвой, в котором у вампира 50% от его бывших НР. ';
$atext[1730]='<b>Защита Мусорщика</b> - Задержка на использование 6 часов. Дает абсолютную защиту от травм в следующем бою. Можно использовать только на себя. Используется только вне боя. ';
$atext[813]='<b>Жажда Наживы</b> - Задержка на использование 24 часа. Увеличивает на 1 час шанс выпадение ресурсов с монстров в Лабиринте Хаоса в 2 раза. Можно использовать только на себя. Используется только вне боя. ';
$atext[723]='<b>Помощь Темному Собрату</b> - Позволяет вмешаться в бой на 3 хода, если на стороне, куда вмешиваемся живые персонажи только темной склонности, а против нет ни одного живого темного персонажа. После 3го хода персонаж автоматически выходит из боя и не может более в него зайти. Если персонажем уже был использован свиток выход из боя, то войти в тот же бой с помощью этой абилити не получится. В бои на Арене Богов и Противостояние невозможно вмешаться с помощью этой абилити. Можно использовать только на себя. Используется только вне боя.';
$atext[830]='<b>Темная Медитация</b> - Задержка на использование 8 часов. Дает полный иммунитет от нападений (включая клановые войны) на 1 час. В течение этого времени персонаж не может проводить бои и перемещаться по комнатам. Можно использовать только на себя. Используется только вне боя. ';
$atext[850]='<b>Аура Жизни</b> - Пассивная аура, время действия ежедневно с 09:00 до 21:00. Увеличивает скорость восстановления НР и маны на 30%. ';
$atext[851]='<b>Аура Лечения</b> - Пассивная аура, время действия ежедневно с 09:00 до 21:00. Уменьшает срок действия полученных травм на 25%. ';
$atext[852]='<b>Аура Благодати</b> - Пассивная аура, время действия ежедневно с 09:00 до 21:00. Уменьшает шанс получения травмы от критового удара на 10%, уменьшает время действия наложенных на персонажа игровых заклятий молчания на 20%.';
$atext[805]='<b>Печать Инквизиции</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды, который тут же получает игровое молчание на 3 минуты и запрет на использование любых абилити на 20 минут. На одного персонажа можно использовать только 1 раз за бой. ';
$atext[705]='<b>Исцеление</b> - 10 штук в сутки - Немедленно восстанавливает 90 НР персонажа. Можно использовать только на себя 1 раз за бой. ';
$atext[708]='<b>Спасение Души</b> - 10 штук в сутки - Позволяет защитить от гибели другого персонажа любой склонности на своей стороне в его следующем размене, оставляя ему при любом ударе не менее 1 НР. Если удар не нанес урона, абилити считается использованным. На одного персонажа можно использовать только 1 раз за бой. На себя использование запрещено. ';
$atext[709]='<b>Светлое Возмездие</b> - 3 штуки в сутки - Уменьшает броню одного выбранного противника на 15% на последующие 5 разменов, а каждому из троих использовавших поднимает урон на 10 единиц на последующие 5 разменов. Выбор всех троих использовавших должен быть одинаков. На одного персонажа можно использовать только 1 раз за бой. ';
$atext[823]='<b>Светлое Изгнание</b> - 3 штуки в сутки - Забирает из любого монстра (включая элементалей, монстров призыва и монстров темного вызова), призванного в бой на противоположной стороне от 40 до 70% НР рандомно. На одного и того же монстра можно использовать только 1 раз за бой.';
$atext[720]='<b>Светлое Возрождение</b> - 3 штуки в сутки - Позволяет возродить погибшего персонажа любой склонности со своей стороны на 5 ходов. Персонаж возрождается с 25% НР от его общей жизни и через 5 ходов автоматически вновь погибает. На одного персонажа можно использовать только 1 раз за бой. На себя использование запрещено. ';
$atext[846]='<b>Сострадание</b> - Время действия ежедневно с 09:00 до 21:00 - задержка на использование 1 час. Позволяет исцелить травму персонажу любой склонности, если до конца травмы осталось менее 15 минут. Использовавший эту абилити получает неизлечимую травму на 2 минуты. Используется только вне боя. На себя использование запрещено. ';
$atext[1731]='<b>Защита Мироздателя</b> - Задержка на использование 6 часов. Дает абсолютную защиту от травм в следующем бою. Можно использовать только на себя. Используется только вне боя. ';
$atext[844]='<b>Озарение</b> - Задержка на использование 24 часа. Увеличивает на 1 час шанс получения Оружия Хаоса с Исчадия Хаоса в 2 раза. Можно использовать только на себя. Используется только вне боя. ';
$atext[724]='<b>Помощь Светлому Собрату</b> - Позволяет вмешаться в бой на 3 хода, если на стороне, куда вмешиваемся живые персонажи только светлой склонности, а против нет ни одного живого светлого персонажа. После 3го хода персонаж автоматически выходит из боя и не может более в него зайти. Если персонажем уже был использован свиток выход из боя, то войти в тот же бой с помощью этой абилити не получится. В бои на Арене Богов и Противостояние невозможно вмешаться с помощью этой абилити. Можно использовать только на себя. Используется только вне боя. ';
$atext[831]='<b>Светлая Медитация</b> - Задержка на использование 8 часов. Дает полный иммунитет от нападений (включая клановые войны) и от укусов вампиров на 1 час. В течение этого времени персонаж не может проводить бои и перемещаться по комнатам. Можно использовать только на себя. Используется только вне боя. ';
$atext[860]='<b>Аура Справедливости</b> - Пассивная аура, время действия ежедневно с 21:00 до 09:00. Повышает вероятность действия чеснока на 10%';
$atext[861]='<b>Аура Баланса</b> - Пассивная аура, время действия ежедневно с 09:00 до 21:00. Уменьшает на 10% вероятность получения травмы с критового удара и увеличивает скорость восстановления НР и маны на 20%. ';
$atext[862]='<b>Аура Стихий</b> - Пассивная аура, время действия круглосуточно. Добавляет к урону кулаком, урон равный уровню персонажа и снижает шанс получения травмы на 25%.';
$atext[711]='<b>Принуждение</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды, принуждая его произвести следующий размен с использовавшим на него данную абилити. Использовать на одного и того же персонажа можно 5 раз за бой.';
$atext[703]='<b>Отпор</b> - 10 штук в сутки - Увеличивает МФ антиуворота и МФ антикрита на 5% в последующих 5 разменах. Можно использовать только на себя 1 раз за бой.';
$atext[706]='<b>Щит Опеки</b> - 10 штук в сутки - Позволяет поглотить урон нанесенный персонажу любой склонности на своей стороне в его следующем размене, сокращая нанесенный урон до 1НР. Если удар не нанес урона, абилити считается использованным. На одного персонажа можно использовать только 1 раз за бой. На себя использование запрещено. ';
$atext[721]='<b>Подчинение</b> - 3 штуки в сутки - Лишает одного выбранного противника возможности нанести критический удар или увернуться на 5 последующих разменов. Выбор всех троих использовавших должен быть одинаков. На одного персонажа можно использовать только 1 раз за бой.';
$atext[722]='<b>Боевой Клич</b> - 3 штуки в сутки - Немедленно одноразово восстанавливает жизнь на 25НР каждому из троих использовавших и увеличивает им броню на 10 единиц и урон на 10 единиц на последующие 5 разменов.';
$atext[804]='<b>Дымовая Завеса</b> - 3 штуки в сутки - Превращает всю команду союзников в невидимок на время равное двум таймаутам. После чего, вся команда получает задержку на использование данного абилити на 1 час. ';
$atext[826]='<b>Ледяной Интеллект</b> - Задержка на использование 6 часов. Повышает на 30 минут  интеллект персонажа на количество единиц, равное уровню персонажа. Можно использовать только на себя. Используется только вне боя.';
$atext[1732]='<b>Защита Хранителя</b> - Задержка на использование 6 часов. Дает абсолютную защиту от травм в следующем бою. Можно использовать только на себя. Используется только вне боя.';
$atext[848]='<b>Фортуна</b> - Задержка на использование 24 часа. Дает на 1 час вероятность получить в любом бою против игроков ресурсы из Лабиринта Хаоса, но не более 10 единиц в общей сложности. Можно использовать только на себя. Используется только вне боя.';
$atext[725]='<b>Помощь Нейтральному Собрату</b> - Позволяет вмешаться в бой на 3 хода, если на стороне, куда вмешивается персонаж, остались в живых только персонажи нейтральной склонности, а против нет ни одного живого нейтрального персонажа. После 3го хода персонаж автоматически выходит из боя и не может более в него зайти. Если персонажем уже был использован свиток выход из боя, то войти в тот же бой с помощью этой абилити не получится. В бои на Арене Богов и Противостояние невозможно вмешаться с помощью этой абилити. Можно использовать только на себя. Используется только вне боя.';
$atext[832]='<b>Нейтральная Медитация</b> - Задержка на использование 8 часов. Дает полный иммунитет от нападений (включая клановые войны) и от укусов вампиров на 1 час. В течение этого времени персонаж не может проводить бои и перемещаться по комнатам. Можно использовать только на себя. Используется только вне боя. ';
$atext[716]='<b>Щит Хаоса</b> - Задержка на использование 12 часов. Позволяет поглотить урон от следующего размена, сокращая его до 1НР. Если удар не нанес урона, абилити считается использованным. Можно использовать только на себя.';
$atext[712]='<b>Безумие Хаоса</b> - 10 штук в сутки - Добавляет 10 единиц к урону на последующие 5 разменов, при этом уменьшая все модификаторы на 10% и броню на 10% на последующие 5 разменов. Можно использовать только на себя.';
$atext[713]='<b>Аура Хаоса</b> - Активная аура. Увеличивает рандомно один модификатор на 20% до конца боя, при этом снижая рандомно другой модификатор на 20% до конца боя. Использовать можно только на себя 1 раз в бою. ';
$atext[714]='<b>Серый Покров</b> - 5 штук в сутки - Накладывается в бою на персонажа из противоположной команды, уровень которого не выше, чем уровень использующего. Запрещает жертве восстанавливать здоровье (самому или со стороны) на 3 последующих размена. На одного персонажа можно использовать только 1 раз за бой.';
$atext[715]='<b>Прорыв</b> - 10 штук в сутки - Немедленно восстанавливает 10% от общего количества НР и поднимает на 5% получаемый опыт в текущем бою. Можно использовать только на себя 1 раз за бой.';
$atext[717]='<b>Круговая Оборона</b> - 3 раза в сутки - Закрывает текущий бой от вмешательства на 10 минут, после чего, все команды получают задержку на использование данного абилити на 1 час. Можно использовать только в боях начатых с хаотической или групповой заявки. Нельзя использовать в первые 5 минут боя.';
$atext[838]='<b>Чистый Разум</b> - Задержка на использование 12 часов. Увеличивает на 3 часа шанс нанести травму на 10% и уменьшает вероятность получения травмы на 10%. Можно использовать только на себя. Используется только вне боя.';
$atext[834]='<b>Серая Медитация</b> - Задержка на использование 8 часов. Немедленно сокращает время травмы (если она есть) в 2 раза и дает полный иммунитет от нападений и от укусов вампиров на 1 час. В течение этого времени персонаж не может проводить бои и перемещаться по комнатам. Можно использовать только на себя. Используется только вне боя. ';
$atext[863]='<b>Светлый Обряд</b> - 3 штуки в сутки - Призывает в бой Небесного Защитника, уровень которого определяется средним (арифметическим) уровнем из троих вызвавших его персонажей.';	
$atext[864]='<b>Темное Коварство</b> - 3 штуки в сутки - Забирает из выбранного монстра противника (элементалей или небесного защитника) от 40 до 70% НР рандомно и 50% забранных из монстра НР делит поровну на каждого из трех использовавших, восстанавливая им жизнь. На одного и того же монстра можно использовать только 1 раз за бой. Не работает на клонов и монстров призыва.';

$atext[718]='<b>Закрытие боя</b> - Замковая - Закрывает текущий бой от вмешательства на 30 минут, если в бою уже более 20 человек, использовать нельзя!.';
$atext[719]='<b>Изолирование боя</b> - Боевая Магия - Изолирование боя до 10 человек, не позволяет войти в бой и выйти из него!';

$atext[2020]='<b>Шквал молний</b> - Боевая Магия - созданная цепь наносит урон в процентном соотношении от максимальных ХП персонажа, урон получают 3-5 персонажей рандомно из противоположной команды!';



$atext[10001]='<b>Зеркальный удар</b> - при размене с наемником (при его попадании) противник получает двойной удар!';
$atext[10002]='<b>Вторая жизнь</b> -  при размене с наемником, если он нанес урон, то восстанавливает себя на этот урон!';


$atext[20001]='<b>Большие сапоги</b> -  увеличивает скорость передвижения по клубу, каждый уровень наемника дает 1%';
$atext[20002]='<b>Дополнительные руки</b> - увеличивает вместимость рюкзака, 1 умение = 200 единиц, максимум 5 умений.';
$atext[20003]='<b>Автосбор в лабиринте</b> - автосбор дропа в Лабиринте Хаоса!';
$atext[20004]='<b>Aвтосбор в загороде</b> - автосбор дропа в загороде!';
$atext[20005]='<b>Умный подход</b> - увеличивает % получаемого опыта основного персонажа, 1 умение = 2%, максимум 5 умений.';
$atext[20006]='<b>Бонус репутации</b> - увеличивает % получаемой репутации основного персонажа, 1 умение = 2%, максимум 5 умений.';
$atext[20007]='<b>Бонус РК</b> -  увеличивает % получаемого рк основного персонажа, 1 умение = 2%, максимум 5 умений.';


$abilname[840]='/"Аура.*Ярости"/iU';
$abilname[841]='/"Аура.*Ночи"/iU';
$abilname[842]='/"Аура.*Защиты"/iU';
$abilname[704]='/"Темное разрушение"/iU';
$abilname[726]='/"Гнев Ангела"/iU';
$abilname[727]='/"Порча"/iU';
$abilname[728]='/"Иммунитет"/iU';
$abilname[701]='/"Жажда.*крови"/iU';
$abilname[702]='/"Темный щит"/iU';
$abilname[707]='/"Темный ритуал"/iU';
$abilname[828]='/"Темный.*вызов"/iU';
$abilname[808]='/"Темное проклятие"/iU';
$abilname[825]='/"Вампиризм"/iU';
$abilname[1730]='/"Защита.*Мусорщика"/iU';
$abilname[813]='/"Жажда.*Наживы"/iU';
$abilname[723]='/"Помощь.*темному.*собрату"/iU';
$abilname[830]='/"Темная.*Медитация"/iU';
$abilname[850]='/"Аура.*Жизни"/iU';
$abilname[851]='/"Аура.*Лечения"/iU';
$abilname[852]='/"Аура.*Благодати"/iU';
$abilname[805]='/"Печать инквизиции"/iU';
$abilname[705]='/"Исцеление"/iU';
$abilname[708]='/"Спасение души"/iU';
$abilname[709]='/"Светлое Возмездие"/iU';
$abilname[823]='/"Светлое изгнание"/iU';
$abilname[720]='/"Светлое Возрождение"/iU';
$abilname[846]='/"Сострадание"/iU';
$abilname[1731]='/"Защита.*Мироздателя"/iU';
$abilname[844]='/"Озарение"/iU';
$abilname[724]='/"Помощь.*светлому.*собрату"/iU';
$abilname[831]='/"Светлая.*Медитация"/iU';
$abilname[860]='/"Аура.*Справедливости"/iU';
$abilname[861]='/"Аура.*Баланса"/iU';
$abilname[862]='/"Аура.*Стихий"/iU';
$abilname[711]='/"Принуждение"/iU';
$abilname[703]='/"Отпор"/iU';
$abilname[706]='/"Щит опеки"/iU';
$abilname[721]='/"Подчинение"/iU';
$abilname[722]='/"Боевой клич"/iU';
$abilname[804]='/"Дымовая завеса"/iU';
$abilname[826]='/"Ледяной.*Интеллект"/iU';
$abilname[1732]='/"Защита.*Хранителя"/iU';
$abilname[848]='/"Фортуна"/iU';
$abilname[725]='/"Помощь.*нейтральному.*собрату"/iU';
$abilname[832]='/"Нейтральная.*Медитация"/iU';
$abilname[716]='/"Щит.*Хаоса"/iU';
$abilname[712]='/"Безумие.*Хаоса"/iU';
$abilname[713]='/"Аура.*Хаоса"/iU';
$abilname[714]='/"Серый покров/iU';
$abilname[715]='/"Прорыв"/iU';
$abilname[717]='/"Круговая оборона"/iU';
$abilname[718]='/"Закрытие боя"/iU';
$abilname[719]='/"Изолирование боя"/iU';


$abilname[838]='/"Чистый.*Разум"/iU';
$abilname[834]='/"Серая.*Медитация"/iU';
$abilname[863]='/"Светлый.*Обряд"/iU';	
$abilname[864]='/"Темное.*Коварство"/iU';

$abilname[10001]='/"Зеркальный.*удар"/iU';
$abilname[10002]='/"Вторая.*жизнь"/iU';

$abilname[2020]='/"Шквал.*молний"/iU';



$abn[840]='"Аура Ярости"';
$abn[841]='"Аура Ночи"';
$abn[842]='"Аура Защиты"';
$abn[704]='"Темное Разрушение"';
$abn[726]='"Гнев Ангела"';
$abn[727]='"Порча"';
$abn[728]='"Иммунитет"';
$abn[701]='"Жажда крови"';
$abn[702]='"Темный Щит"';
$abn[707]='"Темный Ритуал"';
$abn[828]='"Темный Вызов"';
$abn[808]='"Темное Проклятие"';
$abn[825]='"Вампиризм"';
$abn[1730]='"Защита Мусорщика"';
$abn[813]='"Жажда Наживы"';
$abn[723]='"Помощь Темному Собрату"';
$abn[830]='"Темная Медитация"';
$abn[850]='"Аура Жизни"';
$abn[851]='"Аура Лечения"';
$abn[852]='"Аура Благодати"';
$abn[805]='"Печать Инквизиции"';
$abn[705]='"Исцеление"';
$abn[708]='"Спасение Души"';
$abn[709]='"Светлое Возмездие"';
$abn[823]='"Светлое Изгнание"';
$abn[720]='"Светлое Возрождение"';
$abn[846]='"Сострадание"';
$abn[1731]='"Защита Мироздателя"';
$abn[844]='"Озарение"';
$abn[724]='"Помощь Светлому Собрату"';
$abn[831]='"Светлая Медитация"';
$abn[860]='"Аура Справедливости"';
$abn[861]='"Аура Баланса"';
$abn[862]='"Аура Стихий"';
$abn[711]='"Принуждение"';
$abn[703]='"Отпор"';
$abn[706]='"Щит Опеки"';
$abn[721]='"Подчинение"';
$abn[722]='"Боевой Клич"';
$abn[804]='"Дымовая Завеса"';
$abn[826]='"Ледяной Интеллект"';
$abn[1732]='"Защита Хранителя"';
$abn[848]='"Фортуна"';
$abn[725]='"Помощь Нейтральному Собрату"';
$abn[832]='"Нейтральная Медитация"';
$abn[716]='"Щит Хаоса"';
$abn[712]='"Безумие Хаоса"';
$abn[713]='"Аура Хаоса"';
$abn[714]='"Серый Покров"';
$abn[715]='"Прорыв"';
$abn[717]='"Круговая Оборона"';
$abn[718]='"Закрытие боя"';
$abn[719]='"Изолирование боя"';
$abn[838]='"Чистый Разум"';
$abn[834]='"Серая Медитация"';
$abn[863]='"Светлый Обряд"';	
$abn[864]='"Темное Коварство"';

$abn[10001]='"Зеркальный удар"';
$abn[10002]='"Вторая жизнь"';

$abn[2020]='"Шквал молний"';


?>