<?
							$coll1['111001']['name']='Карта Химеры';
							$coll1['111001']['img']='card1_1.gif';
							$coll1['111001']['itemscount']=-1;
							$coll1['111001']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111002']['name']='Карта Пирагмона';
							$coll1['111002']['img']='card1_2.gif';
							$coll1['111002']['itemscount']=-1;
							$coll1['111002']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111003']['name']='Карта Ареса';
							$coll1['111003']['img']='card1_3.gif';
							$coll1['111003']['itemscount']=-1;
							$coll1['111003']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111004']['name']='Карта Гидры';
							$coll1['111004']['img']='card1_4.gif';
							$coll1['111004']['itemscount']=-1;
							$coll1['111004']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111005']['name']='Карта Грифона';
							$coll1['111005']['img']='card1_5.gif';
							$coll1['111005']['itemscount']=-1;
							$coll1['111005']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111006']['name']='Карта Aстерия';
							$coll1['111006']['img']='card1_6.gif';
							$coll1['111006']['itemscount']=-1;
							$coll1['111006']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111007']['name']='Карта Палланта';
							$coll1['111007']['img']='card1_7.gif';
							$coll1['111007']['itemscount']=-1;
							$coll1['111007']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111008']['name']='Карта Аэллы';
							$coll1['111008']['img']='card1_8.gif';
							$coll1['111008']['itemscount']=-1;
							$coll1['111008']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111009']['name']='Карта Aлкионея';
							$coll1['111009']['img']='card1_9.gif';
							$coll1['111009']['itemscount']=-1;
							$coll1['111009']['letter']='Получить эту карту можно участвуя в хаотичных боях и выполняя задания Лабиринта Хаоса.';

							$coll1['111010']['name']='Футляр';
							$coll1['111010']['img']='card1_box.gif';
							$coll1['111010']['itemscount']=-1;
							$coll1['111010']['letter']='Футляр позволяет собрать карты в коллекцию. Получить футляр можно пройдя все квесты Лабиринта Хаоса.';


							$coll1['111000']['name']='Коллекция «Тайны Лабиринта»';
							$coll1['111000']['img']='card1_koloda.gif';
							$coll1['111000']['itemscount']=-1;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
							$coll2['112001']['name']='Карта Духа форума';
							$coll2['112001']['img']='cards2_klja234sd_1.gif';
							$coll2['112001']['letter']='Дух Форума - старый сварливый зануда, который так любит читать все, что пишут жители. Неважно, ропот там, прошение или просто сплетни, он обязательно прочитает каждую строчку. Тот еще книголюб и заядлый приятель Архивариуса. Карту Духа Форума можно получить делая подарки другим персонажам в Цветочном магазине.';
							$coll2['112001']['itemscount']=-1;

							$coll2['112002']['name']='Карта Удачи';
							$coll2['112002']['img']='cards2_kjaewr1_2.gif';
							$coll2['112002']['letter']='Удача - юная богиня, любящая устраивать состязания между жителями по любому поводу. Ее расточительность не идет в сравнение ни с чем - большая часть подарков, которые вы найдете у себя в рюкзаке, окажутся именно от неё. Карту Удачи можно получить бросая монетки в Фонтан на Торговой улице.';
							$coll2['112002']['itemscount']=-1;

							$coll2['112003']['name']='Карта Архивариуса';
							$coll2['112003']['img']='cards2_lasjrba2_3.gif';
							$coll2['112003']['letter']='Архивариус - один из старейших хранителей всех рукописей мира ОлдБК, обитающий в подвалах и подземельях города. Карту Архивариуса можно получить участвуя в турнирах Башни Смерти.';
							$coll2['112003']['itemscount']=-1;

							$coll2['112004']['name']='Карта Комментатора';
							$coll2['112004']['img']='cards2_mna23sqa_4.gif';
							$coll2['112004']['letter']='Комментатор - любопытный и любознательный старец, мимо которого не пройдет ни одно событие в городе, будь то нашествие Драконов или злостное избиение мальчугана в подворотне Парковой улицы. Карту Комментатора можно получить побеждая в турнирах Руин старого замка.';
							$coll2['112004']['itemscount']=-1;

							$coll2['112005']['name']='Карта Мусорщика';
							$coll2['112005']['img']='cards2_las3ndedsc_5.gif';
							$coll2['112005']['letter']='Путь Мусорщика – это путь методичного истребления Света во всех его проявлениях. Дозволительно использовать ради этой цели любые методы и средства. Является объектом почитания Темных, которые справделиво считают его идеалом Темного мировоззрения. Карту Мусорщика можно получить участвуя в боях Противостояния (раздел в поединках) или на Арене Богов.';
							$coll2['112005']['itemscount']=-1;

							$coll2['112006']['name']='Карта Хранителя';
							$coll2['112006']['img']='cards2_la8nxb3q_6.gif';
							$coll2['112006']['letter']='Путь Хранителя - это сохранение баланса между Темными и Светлыми силами. Суждения Хранителя полны мудрости и назидания, он любит долгие беседы о бытие мира и его создании. Постоянно тушит пламя раздора между Мусорщиком и Мироздателем. Карту Хранителя можно получить участвуя в боях Противостояния (раздел в поединках) или на Арене Богов.';
							$coll2['112006']['itemscount']=-1;

							$coll2['112007']['name']='Карта Мироздателя';
							$coll2['112007']['img']='cards2_8mahds3_7.gif';
							$coll2['112007']['letter']='Путь Мироздателя – это борьба с Мусорщиком и его подчиненными, как основная цель. Вторичная цель – это сражение с Темными вообще, к ним последователи Мироздателя испытывают ярость и ненависть, вне зависимости от того, какие взгляды те разделяют. «Любой Темный должен быть уничтожен» – вот основной девиз, под которым ведутся все войны Света. Карту Мироздателя можно получить участвуя в боях Противостояния (раздел в поединках) или на Арене Богов.';
							$coll2['112007']['itemscount']=-1;

							$coll2['112010']['name']='Футляр коллекции «Ангельская поступь»';
							$coll2['112010']['img']='cards2_lah19s39_box.gif';
							$coll2['112010']['letter']='Футляр для коллекции «<a href=http://oldbk.com/encicl/?/collections.html target=_blank>Ангельская поступь</a>», который можно получить за прохождение всех квестов Загорода.';
							$coll2['112010']['itemscount']=-1;

							$coll2['112000']['name']='Коллекция «Ангельская поступь»';
							$coll2['112000']['img']='cards2_kl3oia_coloda.gif';
							$coll2['112000']['itemscount']=-1;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
							$coll3_start=mktime(0,0,0,12,1,2018);
							$coll3_end=mktime(23,59,59,2,28,2019);

							$coll3['113001']['name']='Карта «Белый Медведь»';
							$coll3['113001']['img']='card_winter01.gif';
							$coll3['113001']['itemscount']=-1;
							$coll3['113001']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113002']['name']='Карта «Снежинка»';
							$coll3['113002']['img']='card_winter02.gif';
							$coll3['113002']['itemscount']=-1;
							$coll3['113002']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113003']['name']='Карта «Елка»';
							$coll3['113003']['img']='card_winter03.gif';
							$coll3['113003']['itemscount']=-1;
							$coll3['113003']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113004']['name']='Карта «Снеговик»';
							$coll3['113004']['img']='card_winter04.gif';
							$coll3['113004']['itemscount']=-1;
							$coll3['113004']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113005']['name']='Карта «Дед Мороз»';
							$coll3['113005']['img']='card_winter05.gif';
							$coll3['113005']['itemscount']=-1;
							$coll3['113005']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113006']['name']='Карта «Снегурочка»';
							$coll3['113006']['img']='card_winter06.gif';
							$coll3['113006']['itemscount']=-1;
							$coll3['113006']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113007']['name']='Карта «Снегирь»';
							$coll3['113007']['img']='card_winter07.gif';
							$coll3['113007']['itemscount']=-1;
							$coll3['113007']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113008']['name']='Карта «Шишки»';
							$coll3['113008']['img']='card_winter08.gif';
							$coll3['113008']['itemscount']=-1;
							$coll3['113008']['letter']='Получить эту карту можно в ёлочных хаотичных боях, битвах со Снеговиками, в поединке со Старым Годом, а также участвуя в постройке Снеговика на Центральной площади, кидая Снежки в боях и завершая седьмой день Зимнего штурма.';

							$coll3['113010']['name']='Футляр';
							$coll3['113010']['img']='box_winter02.gif';
							$coll3['113010']['itemscount']=-1;
							$coll3['113010']['letter']='Футляр позволяет собрать карты в коллекцию. Его можно случайно найти в Волшебной шляпе, как награду за выполнение квеста «Ёлочное безумие».';

							$coll3['113000']['name']='Коллекция «Зимняя»';
							$coll3['113000']['img']='coloda_winter.gif';
							$coll3['113000']['itemscount']=-1;

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
							$coll4['114001']['name']='Карта «Сгоревший частокол»';
							$coll4['114001']['img']='card_ruiny01.gif';
							$coll4['114001']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114001']['itemscount']=-1;

							$coll4['114002']['name']='Карта «Сломанный дуб»';
							$coll4['114002']['img']='card_ruiny02.gif';
							$coll4['114002']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114002']['itemscount']=-1;

							$coll4['114003']['name']='Карта «Западный тупик»';
							$coll4['114003']['img']='card_ruiny03.gif';
							$coll4['114003']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114003']['itemscount']=-1;

							$coll4['114004']['name']='Карта «Секретный проход»';
							$coll4['114004']['img']='card_ruiny04.gif';
							$coll4['114004']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114004']['itemscount']=-1;

							$coll4['114005']['name']='Карта «Таинственный склеп»';
							$coll4['114005']['img']='card_ruiny05.gif';
							$coll4['114005']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114005']['itemscount']=-1;

							$coll4['114006']['name']='Карта «Красный трон»';
							$coll4['114006']['img']='card_ruiny06.gif';
							$coll4['114006']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114006']['itemscount']=-1;

							$coll4['114007']['name']='Карта «Синий трон»';
							$coll4['114007']['img']='card_ruiny07.gif';
							$coll4['114007']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114007']['itemscount']=-1;

							$coll4['114008']['name']='Карта «Сокровищница»';
							$coll4['114008']['img']='card_ruiny08.gif';
							$coll4['114008']['letter']='Карта коллекции «Руины Старого Замка». Получить карту можно участвуя в боях против Душ, Стражей и игроков из противоположной команды в турнирах Руин Старого Замка.';
							$coll4['114008']['itemscount']=-1;

							$coll4['114010']['name']='Футляр коллекции «Руины Старого Замка»';
							$coll4['114010']['img']='box_ruiny.gif';
							$coll4['114010']['letter']='Футляр коллекции «<a href=http://oldbk.com/encicl/?/collections.html target=_blank>Руины Старого Замка</a>». Получить футляр можно набрав десять побед в Руинах. Можно накапливать футляры.';
							$coll4['114010']['itemscount']=-1;

							$coll4['114000']['name']='Коллекция «Руины Старого Замка»';
							$coll4['114000']['img']='koloda_ruiny.gif';
							$coll4['114000']['itemscount']=-1;
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

?>
