<?php

$dt_relmap = 10000;

$dt_rooms = array(
	"501" => array ("Восточная Крыша",0,502,505,0,20),
	"502" => array ("Бойница",0,0,0,501,15),
	"503" => array ("Келья 3",0,0,507,0,15),
	"504" => array ("Келья 2",0,0,508,0,15),
	"505" => array ("Западная Крыша 2",501,0,510,0,20),
	"506" => array ("Келья 4",0,507,511,0,15),
	"507" => array ("Келья 1",503,508,0,506,15),
	"508" => array ("Служебная комната",504,0,513,507,25),
	"509" => array ("Зал Отдыха 2",0,0,515,0,20),
	"510" => array ("Западная Крыша 1",505,511,0,0,20),
	"511" => array ("Выход на Крышу",506,0,0,510,20),
	"512" => array ("Зал Статуй 2",0,513,519,0,30),
	"513" => array ("Храм",508,514,0,512,25),
	"514" => array ("Восточная комната",0,0,0,513,20),
	"515" => array ("Зал Отдыха 1",509,0,522,0,20),
	"516" => array ("Старый Зал 2",0,517,523,0,25),
	"517" => array ("Старый Зал 1",0,518,0,516,25),
	"518" => array ("Красный Зал 3",0,519,525,517,35),
	"519" => array ("Зал Статуй 1",512,520,526,518,35),
	"520" => array ("Зал Статуй 3",0,521,0,519,35),
	"521" => array ("Трапезная 3",0,0,528,0,15),
	"522" => array ("Зал Ожиданий",515,0,529,0,20),
	"523" => array ("Оружейная",516,0,530,0,15),
	"524" => array ("Красный Зал-Окна",0,525,531,0,20),
	"525" => array ("Красный Зал",518,526,532,524,35),
	"526" => array ("Гостинная",519,527,533,525,40),
	"527" => array ("Трапезная 1",0,0,0,526,35),
	"528" => array ("Внутренний Двор",521,529,535,0,15),
	"529" => array ("Внутр.Двор-Вход",522,0,0,528,20),
	"530" => array ("Желтый Коридор",523,531,537,0,20),
	"531" => array ("Мраморный Зал 1",524,0,538,530,35),
	"532" => array ("Красный Зал 2",525,533,539,0,20),
	"533" => array ("Библиотека 1",526,534,540,532,20),
	"534" => array ("Трапезная 2",0,0,0,533,15),
	"535" => array ("Проход Внутр. Двора",528,0,541,0,20),
	"536" => array ("Комната с Камином",0,537,0,535,20),
	"537" => array ("Библиотека 3",530,0,543,536,35),
	"538" => array ("Выход из Мрам.Зала",531,0,544,0,20),
	"539" => array ("Красный Зал-Коридор",532,0,545,0,20),
	"540" => array ("Лестница в Подвал 1",533,0,546,0,15),
	"541" => array ("Южный Внутр. Двор",535,542,547,0,20),
	"542" => array ("Трапезная 4",0,543,0,541,15),
	"543" => array ("Мраморный Зал 3",537,0,549,542,40),
	"544" => array ("Мраморный Зал 2",538,545,550,543,40),
	"545" => array ("Картинная Галерея 1",539,0,551,544,40),
	"546" => array ("Лестница в Подвал 2",540,0,552,0,15),
	"547" => array ("Проход Внутр. Двора 2",541,548,553,0,20),
	"548" => array ("Внутр.Двор-Выход",0,549,0,547,20),
	"549" => array ("Библиотека 2",543,550,0,548,35),
	"550" => array ("Картинная Галерея 3",544,551,554,549,40),
	"551" => array ("Картинная Галерея 2",545,0,555,550,40),
	"552" => array ("Лестница в Подвал 3",546,0,556,0,15),
	"553" => array ("Терасса",547,0,557,0,20),
	"554" => array ("Оранжерея",550,555,0,0,20),
	"555" => array ("Зал Ораторов",551,0,0,554,35),
	"556" => array ("Лестница в Подвал 4",552,0,559,0,15),
	"557" => array ("Темная Комната",553,0,0,0,15),
	"558" => array ("Винный Погреб",0,559,0,0,20),
	"559" => array ("Комната в Подвале",556,560,0,558,20),
	"560" => array ("Подвал 1",0,0,0,559,20),
);


$new_dtrooms = array();
reset($dt_rooms);
while(list($k,$v) = each($dt_rooms)) {
	$new_dtrooms[$k+$dt_relmap] = array($v[0],($v[1] > 0 ? $v[1] + $dt_relmap : 0),($v[2] > 0 ? $v[2] + $dt_relmap : 0),($v[3] > 0 ? $v[3] + $dt_relmap : 0),($v[4] > 0 ? $v[4] + $dt_relmap : 0),$v[5]);
}
$dt_rooms = $new_dtrooms;
unset($new_dtrooms);

$dt_halfleft = array(521,528,535,541,547,553,557,515,509,522,529,536,542,548,516,517,523,524,530,531,537,538,543,544,549,550,554,545,551,555); // 30
while(list($k,$v) = each($dt_halfleft)) {
	$dt_halfleft[$k] = $v+$dt_relmap;
}
$dt_halfright = array(501,502,503,504,505,506,507,508,510,511,512,513,514,518,519,520,525,526,527,532,533,534,539,540,546,552,556,558,559,560); // 30
while(list($k,$v) = each($dt_halfright)) {
	$dt_halfright[$k] = $v+$dt_relmap;
}

?>