<?
/*
 1 группа, стоимостью до 1 кр., шанс дропа 50%

     104022 Перья куропатки 
     104085 Вода 
     104075 Чеснок 
     104086 Нитки
     104087 Пергамент
     104056 Лесные ягоды
     104088 Мёд
     104000 Горючее масло
     104016 Куропатка
     104023 Шкура кролика
     104029 Уголь
     104040 Бревно осины
     104057 Грибы
     104076 Картофель
     103001 Мел
     103002 Горсть Соли
     103005 Бирюза
     104058 Герань
     104059 Бархатцы
*/

	$grp1=array( 104022, 104085, 104075, 104086,  104087, 104056, 104088, 104000, 104016,  104023,  104029,  104040,  104057,  104076,  103001, 103002,  103005,  104058,  104059);

/*
2 группа, стоимость ресурсов от 1 до 2 кр., шанс дропа 35%

     104001 Железная руда
     104017 Крольчатина
     104024 Животный жир
     104030 Турмалин
     104037 Глина
     104041 Бревно сосны
     104077 Пшеница
     103006 Гранат
     104002 Медная руда
     104031 Аметист
     103018 Лунный камень
     104042 Бревно груши
     104060 Белена
     104078 Красный перец
     104079 Подсолнух
     104003 Кобальт
     104018 Мясо кабана
     104025 Шкура кабана
     104032 Рубин
     104043 Бревно клена
     104061 Жасмин
*/

	$grp2=array( 104001, 104017, 104024, 104030, 104037, 104041,  104077, 103006,  104002, 104031, 103018,     104042,  104060,  104078, 104079, 104003,  104018, 104025,  104032, 104043 ,  104061 ,104101);
	
	/*
 3 группа, стоимость ресурсов от 2,1 до 3 кр., шанс дропа 20%

     103009 Янтарь
     103010 Малахит
     104080 Гвоздика
     104004 Свинец
     104019 Мясо оленя
     104044 Бревно бука
     104081 Хмель
     104005 Боксит
     104026 Шкура оленя
     104033 Топаз
     104045 Бревно палисандра
     104083 Мука
*/

	$grp3=array(   103009, 103010, 104080,104004, 104019, 104044, 104081, 104005, 104026,  104033,  104045, 104083);
  
	
/*
 4 группа, стоимость ресурсов до 5 кр., шанс дропа 10%

     104006 Касситерит
     104020 Мясо медведя
     104038 Серебряный самородок
     104046 Бревно дуба
     104062 Белладонна
     104082 Алое
     104007 Никель
     104027 Шкура волка
     104047 Бревно красного дерева
     104034 Сапфир
     
*/

	$grp4=array(    104006,  104020,  104038,   104046,   104062 ,   104082 ,  104007,    104027,   104047,  104034, 104098, 104099);
	
	  
     
/*
 5 группа, стоимость ресурсов дороже 5 кр, шанс дропа 5%

     104063 Ведьмин цветок
     104035 Изумруд
     104039 Золотой самородок
     104084 Масло подсолнуха
     104036 Алмаз 	
	*/
	
	$grp5=array(  104063,  104035, 104039, 104084, 104036, 104028, 104091, 104100);
	
	 

?>