<?

//id-bota=>сколько раз
//все боты хилятся когда уних хп = макс хп-180
//все хилы на +180
$mob_hil=array(
	190672 =>100000, //  Пятница хилится пока не выпустит всех своих клонов по 10 шт. каждые 5 мин 80 шт.

	10000 =>100000, //  пока не выпустит всех своих клонов по 10 шт. каждые 5 мин 80 шт.

	190 => 2,  //Чародей
	195 => 2,  // Кровавая Королева
	102 => 600, //Исчадье
	
	116 => 2, //квестовый бот в авалоне
	117 => 10, //квестовый бот в авалоне
	118 => 3, //квестовый бот в авалоне
	119 => 4, //квестовый бот в авалоне
	120 => 10, //квестовый бот в авалоне
	121 => 2, //квестовый бот в авалоне
	122 => 2, //квестовый бот в авалоне	
	123 => 2, //квестовый бот в авалоне	
	124 => 4, //квестовый бот в авалоне		
	125 => 4, //квестовый бот в авалоне			
	
	//драконы
	42 => 0, //Дракоша [6] +
	43 => 0, //Дракошечка [6]
	44 => 0, //Дракошик [7] +
	45 => 0, //Дракосик [7]
	46 => 0, //Драконушка [8] +
	47 => 0, //Дракончик [8]
	48 => 0, //Дракончиха [8]	
	49 => 0, //Драконище [8]	
	50 => 0, //Дракон [9]	+
	51 => 0, //Маленький Дракон [9]	
	52 => 0, //Младший Дракон [9]	
	53 => 0, //Средний Дракон [10]	+
	54 => 0, //Злой Дракон [10]						
	55 => 0, //Темный Дракон [10]
	56 => 0, //Страшный Дракон [10]
	57 => 0, //Большой Дракон [11]	+
	58 => 0, //Огромный Дракон [11]
	59 => 0, //Злющий Драконище [12] +
	60 => 0, //Весёлый Дракон [9]				
	61 => 0, //Яростный Дракон [12] +
	62 => 0, //Свирепый Дракон [13] +	
	63 => 0, //Легендарный Дракон [14] +		
	
	103 => 0, //Исчадье for 6 lvl +
	104 => 0, //Исчадье  for 7 lvl	+
	105 => 0, //Исчадье  for 8 lvl	+
	106 => 0, //Исчадье  for 9 lvl	+
	107 => 0, //Исчадье  for 10 lvl +
	108 => 0,  //Исчадье for 11 lvl +
	109 => 0,  //Исчадье for 12 lvl +	
	110 => 0,  //Исчадье for 13 lvl +		
	
	197 => 13, // квестовый
	198 => 2, // квестовый	
	199 => 18, // квестовый		
	86 =>0, //Древоброды 1 - в кроне ограничитель по времени
	87 =>0, // Древоброды 2- в кроне ограничитель по времени
	89 =>0, //снеговики - в кроне ограничитель по времени
	196 => 2, //Повстанец Ада
	517 => 100000, // замковые
	518 => 100000, // замковые
	519 => 100000, // замковые
	520 => 100000, // замковые
	521 => 100000, // замковые
	522 => 100000, // замковые
	12  => 900000, // лорд разрушитель
); 


?>
