<?

//id-bota=>сколько раз
//все боты хилятся когда уних хп = макс хп-180
//все хилы на +180
$mob_hil=array(
	190672 =>100000, //  Пятница хилится пока не выпустит всех своих клонов по 10 шт. каждые 5 мин 80 шт.

	10000 =>100000, //  пока не выпустит всех своих клонов по 10 шт. каждые 5 мин 80 шт.

	190 => 2,  //Чародей
	195 => 2,  // Кровавая Королева
	102 => 600, //Исчадье
	
	116 => 2, //квестовый бот в авалоне
	117 => 10, //квестовый бот в авалоне
	118 => 3, //квестовый бот в авалоне
	119 => 4, //квестовый бот в авалоне
	120 => 10, //квестовый бот в авалоне
	121 => 2, //квестовый бот в авалоне
	122 => 2, //квестовый бот в авалоне	
	123 => 2, //квестовый бот в авалоне	
	124 => 4, //квестовый бот в авалоне		
	125 => 4, //квестовый бот в авалоне			
	
	//драконы
	42 => 0,//8*360=2880
	43 => 0,//8*360=2880
	44 => 0,//1080
	45 => 0,//1080
	46 => 0,//8*360=2880
	47 => 0,//8*360=2880
	48 => 0,//8*360=2880
	49 => 0,//8*360=2880
	
	50 => 0,//9000
	51 => 0,//9000	
	52 => 0,//9000
	53 => 0,//9000	
	54 => 0,//9000					
	55 => 0,//9000
	
	56 => 0,//12600
	57 => 0,//27000
	58 => 0,//27000
	59 => 0,//27000
	60 => 0,//9720				
	61 => 0,//27000
	62 => 0,//9000	
	63 => 0,//15000		
	64 => 0,//15000	
	65 => 0,//15000	
	
	103 => 0, //Исчадье for 6 lvl 20*180
	104 => 0, //Исчадье  for 7 lvl	 20*180
	105 => 0, //Исчадье  for 8 lvl	 80*180
	106 => 0, //Исчадье  for 9 lvl 120*180	
	107 => 0, //Исчадье  for 10 lvl 300*180
	108 => 0,  //Исчадье for 11 lvl 1600*360
	109 => 0,  //Исчадье for 12 lvl 800*360
	110 => 0,  //Исчадье for 13 lvl 266*360
	101 => 0,  //Исчадье for 14 lvl 100*720
	
	197 => 13, // квестовый
	198 => 2, // квестовый	
	199 => 18, // квестовый		
	86 =>10000, //Древоброды 1 - в кроне ограничитель по времени
	87 =>10000, // Древоброды 2- в кроне ограничитель по времени
	89 =>10000, //снеговики - в кроне ограничитель по времени
	196 => 2, //Повстанец Ада
	517 => 100000, // замковые
	518 => 100000, // замковые
	519 => 100000, // замковые
	520 => 100000, // замковые
	521 => 100000, // замковые
	522 => 100000, // замковые
	12  => 900000, // лорд разрушитель
); 


?>
