<?
//установка для фоток 
$MAXFOTO=28;

//установки групп монстов легкие 0 - сложные 10
// mob id - kol

$mob[0]= array(
		"97" => 1);

$mob[1]= array(
		"90" => 1);

$mob[2]= array(
		"90" => 2);


$mob[3]= array(
		"90" => 3);

$mob[4]= array(
		"91" => 1,
		"90" => 2);

$mob[5]= array(
		"91" => 2);

$mob[6]= array(
		"91" => 1,
		"95" => 1);

$mob[7]= array(
		"95" => 2);

$mob[8]= array(
		"91" => 1,
		"90" => 1,
		"95" => 1);

$mob[9]= array(
		"96" => 5);

$mob[10]= array(
		"96" => 2,
		"97" => 3);

$mob[11]= array(
		"100" => 4,
		"97" => 3);

$mob[12]= array(
		"97" => 3,
		"98" => 3);

$mob[13]= array(
		"91" => 3,
		"99" => 3);

$mob[14]= array(
		"99" => 2,
		"98" => 1,
		"90" => 1,
		"97" => 2);

$mob[15]= array(
		"92" => 2,
		"100" => 2,
		"90" => 2);

$mob[16]= array(
		"92" => 2,
		"99" => 2,
		"100" => 3);

$mob[17]= array(
		"100" => 3,
		"99" => 1,
		"93" => 2);

$mob[18]= array(

		"100" => 2,
		"99" => 1,
		"93" => 3);
	
$mob[19]= array(
		"96" => 4,
		"100" => 2,
		"99" => 1,
		"94" => 1);

$mob[20]= array(
		"98" => 2,
		"100" => 2,
		"93" => 2,
		"94" => 2);


/////////////////////////////////////////////////	
// установка дропа из мобов
// $mdrop[id-моба] =  "шанс %" => итем ид из ешоп
// все шансы в пати скидываются в кучу!
//4000 - Антидот
//3001 -Гранит
//3002 - Песок
//3003 - Верёвка
//3004 - Воск
//3005 - Руда
//3006- Камень Алтаря
//3007 - Кусок Настенного Рисунка
//3008 -Стенной Камень 
//3009 - Золотая нить
//3010 - Антрацит
//3011 - Яшма
//3012 - Александрит
$mdrop[90]=array(
		"3003" => 27,  //Верёвка 
		"3002" => 14, //Горсть
		"3001" => 17, // гринит
		"3004" => 19, 
		"3005" => 27, 
		"3006" => 8, //кам алт
		"4000" => 17, //антидот
		"0" => 80 // пусто
		); 

$mdrop[91]=array(
		"3007" => 27, // +
		"3004" => 17, //+
		"3006" => 12, //+
		"3008" => 12, //+
		"4000" => 8, //антидот
		"15568" => 8, //15568 -Подогнать Кулон
		"3101" => 8,//5 kr
		"0" => 80 //60% пусто
		); 		

$mdrop[92]=array(
		"3005" => 17,  //руда
		"3004" => 12, //воск
		"4000" => 9, //антидот
		"3003" => 9,  //Верёвка
		"3011" => 9,  //Яшма
		"0" => 80 //15 пустых
		); 

//свиток надо потом добавить
$mdrop[93]=array(
		"3001" => 12,  //+
		"3002" => 15,  //+
		"3003" => 17,  //Верёвка
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3006" => 17, //кам алт+
		"3007" => 17,  //+
		"3008" => 17,  //+
//		"3009" => 10,  //золото
//		"3011" => 10,  //Яшма
//		"3010" => 10, //Антрацит
		"3012" => 17, //Александрит
		"3102"=>8, //10 KR
//		"5000" => 2, //Герб
		"15566" =>9, //15566- Подогнать Щит
		"0" => 80 // пусто
		);

//свиток надо потом добавить
$mdrop[94]=array(
		"3003" => 17,  //Верёвка
		"3011" => 17,  //Яшма
		"3010" => 17, //Антрацит
		"3012" => 17, //Александрит
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3006" => 12, //кам алт+
		"3103"=>8, //20 KR		
//		"5000" => 1, //Герб
		"15562" =>8, //Подогнать Бронь
		"0" => 60 // пусто
		);

$mdrop[95]=array(
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"3001" => 22, // гринит
		"3004" => 17, //воск
		"3005" => 17, //руда
		"3007" => 17, //руда
		//"3012" => 5, //Александрит
		"15564" =>9, //15564-Подогнать Шлем
		"3006" => 12, //кам алт
		"4000" => 12, //антидот
		"0" => 45 // пусто
		);


$mdrop[96]=array(
		"3004" => 22, //воск+
		"3005" => 22, //руда+
		"3008" => 22,  //Глина 
		"3002" => 22, //Горсть
		"3003" => 9,  //Верёвка
		"3011" => 9,  //Яшма
		"15566" => 8, //15566-Подогнать Сапоги
		"0" => 45 // пусто
		);


$mdrop[97]=array(
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"0" => 40 // пусто
		);

$mdrop[98]=array(
		"3003" => 17,  //Верёвка
		"15561" =>9, //15561 - Подогнать Кольцо		
		"3004" => 17, //воск+
		"3004" => 17, //руда+
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"15565" => 9, //15565 - Подогнать Перчатки
		"0" => 30 // пусто
		);

$mdrop[99]=array(
		"3003" => 17,  //Верёвка
		"3011" => 17,  //Яшма
		"3010" => 17, //Антрацит
		"3012" => 17, //Александрит
		"0" => 30 // пусто
		);

$mdrop[100]=array(
		"3009" => 12,  //золото
		"3011" => 17,  //Яшма
		"3005" => 17, //руда
		"3002" => 22, //песок
		"3006" => 17, //кам алт+
		"15563" => 8,//15563 -Подогнать Серьги
		"0" => 40 // пусто
		);


		

/////////////////////////////////////////////////	
//установки ловушек  простые 0 - сложнее - 10
// один итем с параметром  в секци
$lov[0]=array(
// magic - time min
		"timer_trap" => "2" // путы на 2 мин
		);

$lov[1]=array(
// magic - time min
		"poison_trap" => "2" // яд на 2 мин
		);

$lov[2]=array(
// magic - time min
		"timer_trap" => "4" //путы на 4 мин
		);

$lov[3]=array(
// magic - time min
		"poison_trap" => "4" // яд на 4 мин
		);


$lov[4]=array(
// magic - time min
		"timer_trap" => "8" //путы на 8 мин
		);

$lov[5]=array(
// magic - time min
		"poison_trap" => "8" // яд на 8 мин
		);

$lov[6]=array(
// magic - time min
		"timer_trap" => "9" //путы на 9 мин
		);

$lov[7]=array(
// magic - time min
		"poison_trap" => "9" // яд на 9 мин
		);
///////////////////////////////////////////////
//Установка хилов
// один итем с параметром  в секци
$hils[0]=array(
		"H" => 10 // 10%
		);

$hils[1]=array(
		"H" => 20 // 20%
		);

$hils[2]=array(
		"H" => 30 // 30%
		);

$hils[4]=array(
		"H" => 40 // 40%
		);

$hils[5]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 60 // 60%
		);

$hils[7]=array(
		"H" => 75 // 75%
		);

$hils[8]=array(
		"H" => 80 // 80%
		);

$hils[9]=array(
		"H" => 90 // 90%
		);

$hils[10]=array(
		"H" => 99 // 99%
		);

/////////////////////////////////////////////////
// установки BOX-ов
//все что в коробках можно выносить из лабы
//лучше чередовать хороший и плохой!

$pbox[0]=array(
///перечень что выпадет из ящщика, т.е. можно выставлять не один итем а несколько, НЕ ПОВТОРЯТЬ ИД
		"gold" => 3003 //Верёвка
		);
$pbox[1]=array(
		"granit" => 3001 //служебное имя - и магазинный ИД из сувенирки
		); 
$pbox[2]=array(
		"timer_trap" => "16" 
		);
$pbox[3]=array(
		"glina" => 3003 // служебное имя - и магазинный ИД из сувенирки
		); 
$pbox[4]=array(
		"gold" => 3009
		);
$pbox[5]=array(
		"silver" => 3011, //Яшма
		"granit" => 3001 
		);
$pbox[6]=array(
		"vostanovlenie_HP" => 246
//		"buter" => 105, 			
		);
$pbox[7]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[8]=array(
		"items" => 3010, //Антрацит
		"antidot" => 4000
		);
$pbox[9]=array(
		"items" => 3002 // служебное имя - и магазинный ИД из сувенирки
	      ); 
$pbox[10]=array(
		"buter" => 105, 
		"gold" => 3003 //Верёвка
		);
$pbox[11]=array(
		"poison_trap" => "8" // яд на 8 мин
		);

$pbox[12]=array(
		"almaz" => 3012 //Александрит
		);
$pbox[13]=array(
		"timer_trap" => "18" //путы на 8 мин
		);
$pbox[14]=array(
		"gold" => 3009
		);
$pbox[15]=array(
		"silver" => 3011, //Яшма
		"antidot" => 4000
		);
$pbox[16]=array(
		"vostanovlenie_HP" => 246
//		"buter" => 105, 	
		);
$pbox[17]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[18]=array(
		"items" => 3012, 
		"antidot" => 4000
		);
$pbox[19]=array(
		"granit" => 3001, 
		"gold" => 3009 //Золотая нить
		);
$pbox[20]=array(
		"gold" => 3009, //Золотая нить
		"items" => 3012 //Александрит
		);



/////////////////////////////////////////////////
	
//установки дропа из сундуков простые 0 - лучше - 10
// labonly - неподлежит выносу из лабы

$sund[0]=array(
//только 1 итем с параметрами в секции - отсальные параметры беруться из соответствующего магазина
		 "shop" => "eshop",
		 "labonly" => "1",
		 "maxdur" => "5",
		 "present"=> "Лабиринт",
		 "id" => "3"
			);
$sund[2]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3001"
			);

$sund[3]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "2",
 		 "present"=> "Лабиринт",
		 "id" => "246"
			);


$sund[4]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "1",
		 "present"=> "Лабиринт",
		 "id" => "105101"
			);

	/*$sund[5]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3001"
			); */
$sund[5]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "199"
			);			


$sund[6]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "200"
			);



$sund[7]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "210"
			);


$sund[8]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "209"
			);


$sund[9]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "",
		 "id" => "4000"
			);

$sund[10]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3010" //Антрацит
			);

$sund[11]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "206"
			);


$sund[12]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3012" //Александрит
			);

$sund[13]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3011" //Яшма
			);

$sund[14]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "204"
			);


$sund[15]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "201"
			);
			
$sund[16]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3012" //Александрит
			);


$sund[17]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "198"
			);
$sund[18]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3009" //Золотая нить
			);

$sund[19]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3010" //Антрацит
			);

$sund[20]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3011" //Яшма
			);
			
////настройки для повторного дропа
// [id] - итема и колво повторов
/// если итема в конфиге нет то безограничения
$reitem[199]=1;
$reitem[200]=1;
$reitem[210]=1;
$reitem[209]=1;
$reitem[206]=1;
$reitem[204]=1;
$reitem[201]=1; //кольцо
$reitem[198]=1;


?>