<?
//установка для фоток 
$MAXFOTO=72;

//установки групп монстов легкие 0 - сложные 10
// mob id - kol

$mob[0]= array(
		"93" => 2,
		"225" => 1);

$mob[1]= array(
		"94" => 2,
		"225" => 1);

$mob[2]= array(
		"225" => 2);
		
$mob[3]= array(

		"210" => 1,
		"211" => 1		
		);

$mob[4]= array(
		"226" => 2);

$mob[5]= array(
		"215" => 1,
		"210" => 2		
		);

$mob[6]= array(
		"212" => 1);
		
$mob[7]= array(
		"225" => 2,
		"226" => 1,		
		);

$mob[8]= array(
		"210" => 2,
		"212" => 1);
		
$mob[9]= array(
		"211" => 2,		
		"212" => 1);

$mob[10]= array(
		"212" => 2);

$mob[11]= array(
		"213" => 2,
		"215" => 1		
		);

$mob[12]= array(
		"211" => 1,		
		"210" => 3);

$mob[13]= array(
		"215" => 3
		);

$mob[14]= array(
		"214" => 2,
		"215" => 1		
		);

$mob[15]= array(
		"214" => 1,
		"215" => 2		
		);

$mob[16]= array(
		"214" => 1,
		"215" => 1,
		"215" => 2
		);

$mob[17]= array(
		"213" => 2,		
		"215" => 2
		);

$mob[18]= array(
		"213" => 1,
		"214" => 1,		
		"215" => 1
		);

$mob[19]= array(
		"216" => 2,		
		"217" => 1
		);
		
$mob[20]= array(
		"214" => 1,		
		"215" => 2
		);

$mob[21]= array(
		"216" => 1,		
		"217" => 1,
		"218" => 1,		
		);

$mob[22]= array(
		"214" => 2,		
		"215" => 2
		);

$mob[23]= array(
		"217" => 2,		
		"218" => 1
		);

$mob[24]= array(
		"215" => 3,		
		"214" => 2,
		"213" => 1,		
		);

////////////установки мобов для J-ботов

$jmob[1]= array(
		"name"=> "Аэлла",
		"id" => 219);
$jmob[2]= array(
		"name"=> "Амфисбена",
		"id" => 220);

$jmob[3]= array(
		"name"=> "Пирагмон",
		"id" => 221);
$jmob[4]= array(
		"name"=> "Сын Ареса",
		"id" => 222);
$jmob[5]= array(
		"name"=> "Химера",
		"id" => 223);
$jmob[6]= array(
		"name"=> "Астерий",
		"id" => 224);

$jmob[6]= array(
		"name"=> "Грифон",
		"id" => 227);
		
$jmob[7]= array(
		"name"=> "Гидра",
		"id" => 228);
		
		
/////////////////////////////////////////////////	
// установка дропа из мобов
// $mdrop[id-моба] =  "шанс %" => итем ид из ешоп
// все шансы в пати скидываются в кучу!
//4000 - Антидот
//3001 -Гранит
//3002 - Песок
//3003 - Верёвка
//3004 - Воск
//3005 - Руда
//3006- Камень Алтаря
//3007 - Кусок Настенного Рисунка
//3008 -Стенной Камень 
//3009 - Золотая нить
//3010 - Антрацит
//3011 - Яшма
//3012 - Александрит
//3013 - Слюда

//свиток надо потом добавить
$mdrop[93]=array(
		"3013" => 17,  //Слюда
		"3013" => 17,  //Слюда
		"3012" => 17, //Александрит
		"0" => 70 // пусто
		);

//свиток надо потом добавить
$mdrop[94]=array(
		"3013" => 17, //Слюда+
		"3015" => 17, //кам алт+
		"0" => 80 // пусто
		);

$mdrop[210]=array(
		"3015" => 12,  //Мрамор
		"3017" => 12, //Портальный минерал X
		"3013" => 12, //Слюда
		"3014" => 12, 
		"3012" => 12, //Александрит
		"4000" => 12, //антидот
		"0" => 70 // пусто
		);


$mdrop[211]=array(
		"3013" => 17,  //Слюда
		"3015" => 22, //Мрамор
		"3015" => 22, //Мрамор
		"3017" => 9, //Портальный минерал X
		"3018" => 9,  
		"3011" => 9,  //Яшма
		"4000" => 9, //антидот		
		"0" => 95 // пусто
		);


$mdrop[212]=array(
		"3021" => 17, //Портальный кристалл ?+
		"3020" => 17, //Портальный кристалл ?+
		"3013" => 17,  //Слюда 
		"3013" => 17,  //Слюда
		"0" => 60 // пусто
		);

$mdrop[213]=array(
		"3021" => 17,  //Портальный кристалл ?
		"3020" =>17, //Портальный кристалл ?
		"3019" => 17, //Портальный кристалл ?+
		"3018" => 17,  //Портальный минерал Y 
		"3017" => 17, //Портальный минерал X
		"4000" => 12, //антидот		
		"0" => 80 // пусто
		);

$mdrop[214]=array(
		"3021" => 17,  //Портальный кристалл ?
		"3020" => 17,  //Портальный кристалл ?
		"3019" => 17, //Портальный кристалл ?
		"3018" => 17, //Портальный минерал Y		
		"3012" => 17, //Александрит
		"0" => 80 // пусто
		);

$mdrop[215]=array(
		"3021" => 12,  //Портальный кристалл ?
		"3020" => 17,  //Портальный кристалл ?
		"3019" => 17, //Портальный кристалл ?
		"3017" => 17, //Портальный минерал X
		"0" => 70 // пусто
		);


$mdrop[216]=array(
		"3018" => 17,  //Портальный минерал Y
		"3017" => 17,  //Портальный минерал X
		"3021" => 12, //Портальный кристалл ?
		"3020" => 12, //Портальный кристалл ?
		"3019" => 12, //Портальный кристалл ?
		"0" => 70 // пусто
		);

$mdrop[217]=array(
		"3013" => 22,  //Слюда
		"3013" => 17,  //Слюда
		"3015" => 22, //Мрамор
		"3015" => 22, //Мрамор
		"3017" => 17, //Портальный минерал X
		"0" => 70 // пусто
		);

$mdrop[218]=array(
		"3009" => 12,  //Золотая нить
		"3011" => 12,  //Яшма
		"3018" => 17, //Портальный минерал Y
		"3017" => 22, //Портальный минерал X
		"3006" => 17, //кам алт+
		"0" => 70 // пусто
		);

$mdrop[225]=array(
		"3009" => 12,  //Золотая нить
		"3011" => 12,  //Яшма
		"3021" => 17, //Портальный кристалл ?
		"3020" => 22, //Портальный кристалл ?
		"3019" => 17, //Портальный кристалл ?
		"0" => 70 // пусто
		);

$mdrop[226]=array(
		"3009" => 12,  //Золотая нить
		"3011" => 12,  //Яшма
		"3015" => 22, //Мрамор
		"3015" => 22, //Мрамор
		"3017" => 17, //Портальный минерал X
//		"2918" => 5,
		"0" => 70 // пусто
		);
////////J-mob drop
$mdrop[219]=array(
		"3013" => 57, // Слюда
		"3015" => 57,	
		"249"=>9,//хилка 180		
		"50077"	=> 10, // портал			
//		"4001" => 1, //пропуск
//		"5000" => 2, //Герб		
		"15566" => 8, //15566-Подогнать Сапоги		
		"0" => 10 // пусто
		);
$mdrop[220]=array(
		"3013" => 17,  //Слюда
		"3015" => 57, //Мрамор
		"249"=>9,//хилка 180		  
		"50076"=> 10, // телепорт		
//		"4001" => 1, //пропуск	
//		"5000" => 2, //Герб				
		"15562" =>8, //Подогнать Бронь	
		"3204" =>8, //чек 50 кр
		"0" => 10 // пусто
		);
$mdrop[221]=array(
		"3017" => 57, //Портальный минерал X 
		"3019" => 57,  	//Портальный кристалл ?
		"249"=>9,//хилка 180		
		"50077"	=> 10, // портал
//		"4001" => 1, //пропуск	
//		"5000" => 2, //Герб					
		"15566" =>8, //15566- Подогнать Щит		
		"3203"=>8,//чек 20 кр
		"0" => 10 // пусто
		);
$mdrop[222]=array(
		"3018" => 57, //Портальный минерал Y
		"3020" => 57, //Портальный кристалл ?
		"249"=>9,//хилка 180
		"50078" =>9, //карта	
//		"5000" => 2, //Герб						
		"50076"=> 10, // телепорт
		"3205"=>8, // чек 100 кр
		"0" => 10 // пусто
		);
$mdrop[223]=array(
		"3020" => 57, //Портальный кристалл ?
		"3021" => 57,	//Портальный кристалл ?
		"249"=> 9,//хилка 180	
		"15564" =>8, //15564-Подогнать Шлем		
		"0" => 10 // пусто
		);
$mdrop[224]=array(
		"3020" => 57, //Портальный кристалл ?
		"3021" => 57,	//Портальный кристалл ?	
		"50077"	=> 10, // портал			
		"50078" =>9, //карта	
		"0" => 10 // пусто
		);

$mdrop[227]=array(
		"3020" => 56,  //Портальный кристалл ?
		"3021" => 56,  //Портальный кристалл ?
		"50077"	=> 10, // портал	
		"249"=>9,//хилка 180	
		"15563" => 8,//15563 -Подогнать Серьги
		"0" => 20 // пусто
		);

$mdrop[228]=array(
		"3009" => 52,  //Золотая нить
		"3011" => 52,  //Яшма
		"15565" => 8, //15565 - Подогнать Перчатки
		"0" => 30 // пусто
		);

								

/////////////////////////////////////////////////	
//установки ловушек  простые 0 - сложнее - 10
// один итем с параметром  в секци
$lov[0]=array(
// magic - time min
		"timer_trap" => "2" // путы на 2 мин
		);

$lov[1]=array(
// magic - time min
		"poison_trap" => "2" // яд на 2 мин
		);

$lov[2]=array(
// magic - time min
		"stat_trap" => "4" //
		);

$lov[3]=array(
// magic - time min
		"poison_trap" => "4" // яд на 4 мин
		);


$lov[4]=array(
// magic - time min
		"timer_trap" => "8" //путы на 8 мин
		);

$lov[5]=array(
// magic - time min
		"stat_trap" => "8" // яд на 8 мин
		);

$lov[6]=array(
// magic - time min
		"timer_trap" => "9" //путы на 9 мин
		);

$lov[7]=array(
// magic - time min
		"poison_trap" => "9" // яд на 9 мин
		);

$lov[8]=array(
// magic - time min
		"stat_trap" => "10" //путы на 9 мин
		);

$lov[9]=array(
// magic - time min
		"poison_trap" => "9" // яд на 9 мин
		);		

$lov[10]=array(
// magic - time min
		"stat_trap" => "15" //путы на 9 мин
		);
		
///////////////////////////////////////////////
//Установка хилов
// один итем с параметром  в секци
$hils[0]=array(
		"H" => 20 // 10%
		);

$hils[1]=array(
		"H" => 20 // 20%
		);

$hils[2]=array(
		"H" => 30 // 30%
		);

$hils[4]=array(
		"H" => 40 // 40%
		);

$hils[5]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 60 // 60%
		);

$hils[7]=array(
		"H" => 75 // 75%
		);

$hils[8]=array(
		"H" => 80 // 80%
		);

$hils[9]=array(
		"H" => 90 // 90%
		);

$hils[10]=array(
		"H" => 99 // 99%
		);

/////////////////////////////////////////////////
// установки BOX-ов
//все что в коробках можно выносить из лабы
//лучше чередовать хороший и плохой!

$pbox[0]=array(
///перечень что выпадет из ящщика, т.е. можно выставлять не один итем а несколько, НЕ ПОВТОРЯТЬ ИД
		"alf" => 3019,
		"antidot" => 4000		
		);
$pbox[1]=array(
		"bet" => 3020, //служебное имя - и магазинный ИД из сувенирки
		"vostanovlenie_HP" => 246
//		"buter" => 105, 		
		); 
$pbox[2]=array(
		"timer_trap" => "16" 
		);
$pbox[3]=array(
		"gamm" => 3021, // служебное имя - и магазинный ИД из сувенирки
		"ugol" => 3015 		
		); 
$pbox[4]=array(
		"gold" => 3018,
		"ugol" => 3013 		//Слюда
		);
$pbox[5]=array(
		"silver" => 3017, //Портальный минерал X
		"ugol" => 3013 // Слюда
		);
$pbox[6]=array(
		"almaz" => 3015,
		"buter" => 105, 		
		);
$pbox[7]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[8]=array(
		"alzss" => 3015, //Мрамор
		"antidot" => 4000
		);
$pbox[9]=array(
		"items" => 3002 // служебное имя - и магазинный ИД из сувенирки
	      ); 
$pbox[10]=array(
		"buter" => 105, 
		"gold" => 3013 // Слюда
		);
$pbox[11]=array(
		"poison_trap" => "8" // яд на 8 мин
		);

$pbox[12]=array(
		"almaz" => 3015, //Мрамор
		"ugolk" => 3014, 	//Слюда	
		);
$pbox[13]=array(
		"timer_trap" => "18" //путы на 8 мин
		);
$pbox[14]=array(
		"gold" => 3009
		);
$pbox[15]=array(
		"rudas" => 3017, //Портальный минерал X
		"antidot" => 4000
		);
$pbox[16]=array(
		"vostanovlenie_HP" => 246
//			"buter" => 105, 	
		);
$pbox[17]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[18]=array(
		"items" => 3018, 
		"antidot" => 4000
		);
$pbox[19]=array(
		"granit" => 3012, //Александрит
		"gold" => 3021 //Портальный кристалл ?
		);
$pbox[20]=array(
		"gold" => 3020, //Портальный кристалл ?
		"items" => 3011
		);



/////////////////////////////////////////////////
	
//установки дропа из сундуков простые 0 - лучше - 10
// labonly - неподлежит выносу из лабы

$sund[0]=array(
//только 1 итем с параметрами в секции - отсальные параметры беруться из соответствующего магазина
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "1",
		 "present"=> "",
		 "id" => "50177"
			);
$sund[2]=array(
		 "shop" => "eshop",
		 "labonly" => "1",
		 "maxdur" => "4",
 		 "present"=> "",
		 "id" => "5205"
			);

$sund[3]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "206"
			);


$sund[4]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "202"
			);

$sund[5]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "199"
			);			

$sund[6]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "200"
			);

$sund[7]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "210"
			);


$sund[8]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "209"
			);


$sund[9]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "197" ///!!!
			);

$sund[10]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "1",
 		 "present"=> "",
		 "id" => "50176"
			);

$sund[11]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "196" 
			);


$sund[12]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "195"
			);

$sund[13]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "208"
			);

$sund[14]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "204"
			);


$sund[15]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "201"
			);
			
$sund[16]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "205"
			);


$sund[17]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "198"
			);
$sund[18]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "203"
			);
/*
$sund[19]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3010" //Антрацит
			);

$sund[20]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3011"
			);
		*/	
////настройки для повторного дропа
// [id] - итема и колво повторов
/// если итема в конфиге нет то безограничения

$reitem[210]=1;
$reitem[209]=1;
$reitem[208]=1;
$reitem[206]=1;
$reitem[205]=1;
$reitem[204]=1;
$reitem[203]=1;
$reitem[202]=1;
$reitem[201]=1; //кольцо
$reitem[200]=1;
$reitem[199]=1;
$reitem[198]=1;
$reitem[197]=1;
$reitem[196]=1;
$reitem[195]=1;


?>