<?
//установка для фоток 
$MAXFOTO=28;

//установки групп монстов легкие 0 - сложные 10
// mob id - kol


$mob[0]= array(
		"31" => 1);
$mob[1]= array(
		"30" => 1);
$mob[2]= array(
		"30" => 1,
		"31" => 1);
$mob[3]= array(
		"31" => 2,
		"31" => 1);
$mob[4]= array(
		"31" => 1,
		"30" => 1,		
		"32" => 1);
$mob[5]= array(
		"32" => 1,
		"35" => 1,		
		"33" => 1);
$mob[6]= array(
		"33" => 1,
		"35" => 1,		
		"34" => 1);
		
$mob[7]= array(
		"34" => 2,
		"35" => 1);
		
$mob[8]= array(
		"33" => 1,
		"36" => 1,		
		"34" => 1);
		
$mob[9]= array(
		"33" => 1,
		"37" => 1,		
		"34" => 1);

$mob[10]= array(
		"36" => 1,
		"37" => 1);

$mob[11]= array(
		"38" => 1,
		"36" => 1,
		"37"=> 1);

$mob[12]= array(
		"33" => 1,
		"36" => 1,
		"38" => 1);

$mob[13]= array(
		"37" => 1,
		"36" => 1,		
		"31" => 1);


$mob[14]= array(
		"37" => 1,
		"35" => 1,		
		"32" => 1);

$mob[15]= array(
		"39" => 1,
		"37" => 1,		
		"36" => 1);

$mob[16]= array(
		"38" => 1,
		"35" => 1,
		"37" => 1,		
		"36" => 1);
$mob[17]= array(
		"38" => 1,
		"36" => 1,
		"37" => 1);

$mob[18]= array(

		"39" => 1,
		"37" => 1,
		"36" => 2);
	
$mob[19]= array(
		"41" => 1,
		"38" => 1,
		"36" => 1,
		"37" => 1);

$mob[20]= array(
		"40" => 1,
		"36" => 1,
		"37" => 2);


/////////////////////////////////////////////////	
// установка дропа из мобов
// $mdrop[id-моба] =  "шанс %" => итем ид из ешоп
// все шансы в пати скидываются в кучу!
//4000 - Антидот
//3001 - Гранит
//3002 - Песок
//3003 - Верёвка
//3004 - Воск
//3005 - Руда
//3006 - Камень Алтаря
//3007 - Кусок Настенного Рисунка
//3008 - Стенной Камень 
//3009 - Золотая нить
//3010 - Антрацит
//3011 - Яшма
//3012 - Александрит
$mdrop[30]=array(
		"3003" => 27,  //Верёвка 
		"3002" => 14, //Горсть
		"3001" => 17, // гринит
		"3004" => 19, //Воск
		"3005" => 27, 
		"3006" => 8, //кам алт
		"4000" => 17, //антидот
		"0" => 80 // пусто
		); 

$mdrop[31]=array(
		"3007" => 27, // +
		"3004" => 17, ////Воск
		"3006" => 12, //+
		"3008" => 12, //+
		"4000" => 8, //антидот
		"0" => 80 //60% пусто
		); 		

$mdrop[32]=array(
		"3005" => 17,  //руда
		"3004" => 12, //воск
		"4000" => 9, //антидот
		"3009" => 9,  //Золотая нить
		"3011" => 9,  //Яшма
		"0" => 80 //15 пустых
		); 

//свиток надо потом добавить
$mdrop[33]=array(
		"3001" => 12,  //+
		"3002" => 15,  //+
		"3003" => 17,  //Верёвка
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3006" => 17, //кам алт+
		"3007" => 17,  //+
		"3008" => 17,  //+
		"3012" => 17, //Александрит
		"0" => 80 // пусто
		);

//свиток надо потом добавить
$mdrop[34]=array(
		"3003" => 17,  //Верёвка
		"3011" => 17,  //сереб
		"3010" => 17, //Антрацит
		"3012" => 17, //Александрит
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3006" => 12, //кам алт+
		"0" => 60 // пусто
		);

$mdrop[35]=array(
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"3001" => 12, // гринит
		"3004" => 17, //воск
		"3005" => 17, //руда
		"3007" => 17, //руда
		"3006" => 12, //кам алт
		"4000" => 12, //антидот
		"0" => 45 // пусто
		);


$mdrop[36]=array(
		"3004" => 22, //воск+
		"3005" => 22, //руда+
		"3008" => 22,  //Глина 
		"3002" => 22, //Горсть
		"3003" => 9,  //Веревка
		"3011" => 9,  //Яшма
		"0" => 45 // пусто
		);


$mdrop[37]=array(
		"3004" => 17, //воск+
		"3005" => 17, //руда+
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"0" => 40 // пусто
		);

$mdrop[38]=array(
		"3003" => 17,  //Верёвка
		"3004" => 17, //воск+
		"3004" => 17, //руда+
		"3008" => 17,  //Глина 
		"3002" => 17, //Горсть
		"0" => 30 // пусто
		);

$mdrop[39]=array(
		"3003" => 17,  //Верёвка
		"3011" => 17,  //Яшма
		"3010" => 17, //Антрацит
		"3012" => 17, //Александрит
		"0" => 30 // пусто
		);

$mdrop[40]=array(
		"3009" => 22,  //Золотая нить
		"3011" => 17,  //Яшма
		"3012" => 17, //Александрит
		"3102"=>17, //10 KR	
		"15561" =>9, //15561 - Подогнать Кольцо				
		"3006" => 17, //кам алт+
		"0" => 40 // пусто
		);

$mdrop[41]=array(
		"3009" => 17,  //Золотая нить
		"3011" => 17,  //Яшма
		"3101" => 17,//5 kr	
		"3012" => 17, //Александрит		
		"3006" => 17, //кам алт+
		"0" => 1 // пусто
		);

		

/////////////////////////////////////////////////	
//установки ловушек  простые 0 - сложнее - 10
// один итем с параметром  в секци
$lov[0]=array(
// magic - time min
		"timer_trap" => "2" // путы на 2 мин
		);

$lov[1]=array(
// magic - time min
		"poison_trap" => "2" // яд на 2 мин
		);

$lov[2]=array(
// magic - time min
		"timer_trap" => "4" //путы на 4 мин
		);

$lov[3]=array(
// magic - time min
		"poison_trap" => "4" // яд на 4 мин
		);


$lov[4]=array(
// magic - time min
		"timer_trap" => "8" //путы на 8 мин
		);

$lov[5]=array(
// magic - time min
		"poison_trap" => "8" // яд на 8 мин
		);

$lov[6]=array(
// magic - time min
		"timer_trap" => "9" //путы на 9 мин
		);

$lov[7]=array(
// magic - time min
		"poison_trap" => "9" // яд на 9 мин
		);
///////////////////////////////////////////////
//Установка хилов
// один итем с параметром  в секци
$hils[0]=array(
		"H" => 10 // 10%
		);

$hils[1]=array(
		"H" => 20 // 20%
		);

$hils[2]=array(
		"H" => 30 // 30%
		);

$hils[4]=array(
		"H" => 40 // 40%
		);

$hils[5]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 50 // 50%
		);

$hils[6]=array(
		"H" => 60 // 60%
		);

$hils[7]=array(
		"H" => 75 // 75%
		);

$hils[8]=array(
		"H" => 80 // 80%
		);

$hils[9]=array(
		"H" => 90 // 90%
		);

$hils[10]=array(
		"H" => 99 // 99%
		);

/////////////////////////////////////////////////
// установки BOX-ов
//все что в коробках можно выносить из лабы
//лучше чередовать хороший и плохой!

$pbox[0]=array(
///перечень что выпадет из ящщика, т.е. можно выставлять не один итем а несколько, НЕ ПОВТОРЯТЬ ИД
		"gold" => 3009
		);
$pbox[1]=array(
		"granit" => 3001 //служебное имя - и магазинный ИД из сувенирки
		); 
$pbox[2]=array(
		"timer_trap" => "16" 
		);
$pbox[3]=array(
		"glina" => 3003 // служебное имя - и магазинный ИД из сувенирки
		); 
$pbox[4]=array(
		"gold" => 3009
		);
$pbox[5]=array(
		"silver" => 3011, //Яшма
		"granit" => 3001 
		);
$pbox[6]=array(
		"vostanovlenie_HP" => 246 
		//"buter" => 105, 	
		);
$pbox[7]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[8]=array(
		"items" => 3010, //Антрацит
		"antidot" => 4000
		);
$pbox[9]=array(
		"items" => 3002 // служебное имя - и магазинный ИД из сувенирки
	      ); 
$pbox[10]=array(
		"buter" => 105, 
		"gold" => 3009 
		);
$pbox[11]=array(
		"poison_trap" => "8" // яд на 8 мин
		);

$pbox[12]=array(
		"almaz" => 3012 //Александрит
		);
$pbox[13]=array(
		"timer_trap" => "18" //путы на 8 мин
		);
$pbox[14]=array(
		"gold" => 3009
		);
$pbox[15]=array(
		"silver" => 3011, //Яшма
		"antidot" => 4000
		);
$pbox[16]=array(
		"vostanovlenie_HP" => 246
//		"buter" => 105, 	
		);
$pbox[17]=array(
		"timer_trap" => "15" //путы на 8 мин		
		);
$pbox[18]=array(
		"items" => 3012, //Александрит
		"antidot" => 4000
		);
$pbox[19]=array(
		"granit" => 3001, 
		"gold" => 3009 
		);
$pbox[20]=array(
		"gold" => 3009,
		"items" => 3012 //Александрит
		);



/////////////////////////////////////////////////
	
//установки дропа из сундуков простые 0 - лучше - 10
// labonly - неподлежит выносу из лабы

//только 1 итем с параметрами в секции - отсальные параметры беруться из соответствующего магазина
$sund[0]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "201201"
			);

$sund[1]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "209209"
			);


$sund[2]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "199199"
			);			


$sund[3]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "206206"
			);

$sund[4]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "2",
 		 "present"=> "Лабиринт",
		 "id" => "246"
			);


$sund[5]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "1",
		 "present"=> "Лабиринт",
		 "id" => "105101"
			);



$sund[6]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3001"
			);



$sund[7]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "200200"
			);



$sund[8]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "210210"
			);



$sund[9]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "",
		 "id" => "4000"
			);

$sund[10]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3010" //Антрацит
			);



$sund[11]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3012" //Александрит
			);

$sund[12]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3011" //Яшма
			);

$sund[13]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3011" //Яшма
			);

$sund[14]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "204204"
			);

$sund[15]=array(

		 "shop" => "eshop",
		 "labonly" => "1",
		 "maxdur" => "5",
		 "present"=> "Лабиринт",
		 "id" => "3"
			);
			
$sund[16]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3012" //Александрит
			);


$sund[17]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "198198"
			);

$sund[18]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3009"
			);

/////////////////////////////////////////////////////
//Дополнительный масив магазинных ИД -который будут выбираться рандомно
//топоры
$dop_sund[0]=132;
$dop_sund[1]=130;
//молотки
$dop_sund[2]=144;
$dop_sund[3]=145;
//мечи
$dop_sund[4]=76;
$dop_sund[5]=77;
//сапоги
$dop_sund[6]=38;
$dop_sund[7]=147;
//перчи
$dop_sund[8]=43;
//рубаза
$dop_sund[9]=57;
//шапки
$dop_sund[10]=68;
$dop_sund[11]=69;
//щиты
$dop_sund[12]=107;
$dop_sund[13]=33;
//серьги
$dop_sund[14]=12;
$dop_sund[15]=13;
$dop_sund[16]=30;
//кулон
$dop_sund[17]=20;
$dop_sund[18]=23;
//
$dop_sund[19]=14;
$dop_sund[20]=15;
$dop_sund[21]=7;
$dop_sund[22]=257;
$dop_sund[23]=148;
/////////////////////////////////////////////////
$dop_rand=mt_rand(0,23);
$dop_rand=$dop_sund[$dop_rand];
$sund[19]=array(
		 "shop" => "shop",
		 "labonly" => "0",
		 "sowner" => "true",
 		 "present"=> "Лабиринт",
		 "id" => $dop_rand
			);

			

$sund[20]=array(
		 "shop" => "eshop",
		 "labonly" => "0",
		 "maxdur" => "1",
 		 "present"=> "Лабиринт",
		 "id" => "3010" //Антрацит
			);


			
////настройки для повторного дропа
// [id] - итема и колво повторов
/// если итема в конфиге нет то безограничения
$reitem[199199]=1;
$reitem[200200]=1;
$reitem[210210]=1;
$reitem[209209]=1;
$reitem[206206]=1;
$reitem[204204]=1;
$reitem[201201]=1; //кольцо
$reitem[198198]=1;


?>