<?
//установки групп монстов легкие 0 - сложные 10
// mob id - kol

$mt_rand_23=mt_rand(2,3);


$mob[1]= array(
		"name" =>"Каменный стрaж",
		"id" =>261,
		"kol" => 1);

$mob[2]= array(
		"name"=> "Aлкиoней",
		"id"=>262,
		"kol" => $mt_rand_23);

$mob[3]= array(
		"name" =>"Каменный стрaж",
		"id" =>261,
		"kol" =>$mt_rand_23);

$mob[4]= array(
		"name" =>"Пандион",
		"id"=>266,
		"kol" => 1);

$mob[5]= array(
		"name"=>"Мимант",
		"id" => 263,
		"kol" => $mt_rand_23);
		
/*
$mob[6]= array(
		"name" => "Медузa",
		"id" => 267,
		"kol" => 1);		
*/


//////////
$sjmob[1]= array(
		"name"=> "Медузa",
		"id" => 267);


////////////установки мобов для J-ботов

$jmob[1]= array(
		"name"=> "Аэлла",
		"id" => 219,
		"top"=>25, 
		"left" =>90 );
$jmob[2]= array(
		"name"=> "Амфисбена",
		"id" => 220,
		"top"=>7, 
		"left" =>48 );		

$jmob[3]= array(
		"name"=> "Пирагмон",
		"id" => 221,
		"top"=>25, 
		"left" =>90 );
$jmob[4]= array(
		"name"=> "Сын Ареса",
		"id" => 222,
		"top"=>0, 
		"left" =>-5 );		
		
/////////////////////////////////////////////////	
//установки ловушек  простые 0 - сложнее - 10
// один итем с параметром  в секци
$lov[0]=array(
// magic - time min
		"timer_trap" => "5" // путы на 2 мин
		);

$lov[1]=array(
// magic - time min
		"poison_trap" => "2" // яд на 2 мин
		);

$lov[2]=array(
// magic - time min
		"stat_trap" => "4" //
		);

$lov[3]=array(
// magic - time min
		"poison_trap" => "4" // яд на 4 мин
		);


//Установка хилов
// один итем с параметром  в секци
$hils[0]=array(
		"H" => 20 // 10%
		);

$hils[1]=array(
		"H" => 20 // 20%
		);

$hils[2]=array(
		"H" => 30 // 30%
		);

$hils[4]=array(
		"H" => 40 // 40%
		);

$hils[5]=array(
		"H" => 50 // 50%
		);

/////////////////////////////////////////////////
// установки BOX-ов
//все что в коробках можно выносить из лабы
//лучше чередовать хороший и плохой!

$pbox[0]=array(
///перечень что выпадет из ящщика, т.е. можно выставлять не один итем а несколько, НЕ ПОВТОРЯТЬ ИД
		"alf" => 3019,
		"antidot" => 4306,
		"pvedro"=>4306,		
		);
$pbox[1]=array(
		"bet" => 3020, //служебное имя - и магазинный ИД из сувенирки
		"vostanovlenie_HP" => 246
//		"buter" => 105, 
		); 
$pbox[2]=array(
		"timer_trap" => "16" 
		);
$pbox[3]=array(
		"gamm" => 3021, // служебное имя - и магазинный ИД из сувенирки
		"ugol" => 3015 		
		); 
$pbox[4]=array(
		"gold" => 3018,
		"ugol" => 3014 ,
		"granit" => 3012
		);
$pbox[5]=array(
		"silver" => 3017,
		"ugol" => 3013, 
		"granit" => 3012, 		
		"molot" => 4300
		);
		
/////////////////////////////////////////////////
	
//установки дропа из сундуков простые 0 - лучше - 10
// labonly - неподлежит выносу из лабы

$sund[0]=array(
//только 1 итем с параметрами в секции - отсальные параметры беруться из соответствующего магазина
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "1",
		 "present"=> "",
		 "id" => "50177"
			);
$sund[2]=array(
		 "shop" => "eshop",
		 "labonly" => "1",
		 "maxdur" => "5",
 		 "present"=> "",
		 "id" => "5205"
			);

$sund[3]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
 		 "present"=> "",
		 "id" => "206"
			);


$sund[4]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "202"
			);

$sund[5]=array(
		 "shop" => "shop",
		 "labonly" => "1",
		 "maxdur" => "3",
		 "present"=> "",
		 "id" => "199"
			);			

////настройки для повторного дропа
// [id] - итема и колво повторов
/// если итема в конфиге нет то безограничения

$reitem[210]=1;
$reitem[209]=1;
$reitem[208]=1;
$reitem[206]=1;
$reitem[205]=1;
$reitem[204]=1;
$reitem[203]=1;
$reitem[202]=1;
$reitem[201]=1; 
$reitem[200]=1;
$reitem[199]=1;
$reitem[198]=1;
$reitem[197]=1;
$reitem[196]=1;
$reitem[195]=1;

include ("labconfig_4.php"); // настройки дропа и ботов 


?>