<?
//Общая настройка групп монстров

// ИД - МАстерботов должны быть разными!!!
//Боты для волны маленькие прототипы 3-й лабы
/*
$v_mobs[1]=array(
  "lab" => 0, // выходит из лабы не обрабатывается для создания бота в онлайне!
  "group_level"=>6, // уровневая группа
  "min_level" =>6, //минимальный уровень для нападения
  "max_level" =>6, // максимальный 
  "master_bot" =>42,// мастер бот для старта нападения
  "room"=> array (20,66,21,26,50),
  "bots"=> array(42) 
//  "bots"=> array(42,42,42,42,42,43,43,43,43,43) //команда которая влезит в бой 		  		
  		);
*/
/*
$v_mobs[2]=array(
  "lab" => 0,
  "group_level"=>6, // уровневая группа  
  "min_level" =>6,
  "max_level" =>6,
  "master_bot" =>43,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(43)  //  "bots"=> array(43,43,43,43,43,44,44,44,44,44)  		  		
  		);
*/

$v_mobs[3]=array(
  "lab" => 0,
  "group_level"=>7, // уровневая группа  
  "min_level" =>7,
  "max_level" =>7,
  "master_bot" =>44,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(45,45) 
  		);
/*
$v_mobs[4]=array(
  "lab" => 0,
  "group_level"=>7, // уровневая группа  
  "min_level" =>7,
  "max_level" =>7,
  "master_bot" =>45,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(45,45,45,45,45,45,45,45,45,45)   		  		
  		);
  */

$v_mobs[5]=array(
  "lab" => 0,
  "group_level"=>8, // уровневая группа  
  "min_level" =>8,
  "max_level" =>8,
  "master_bot" =>46,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(46,46,46,46,46,46,46,46,46,46,47,47,47,47,47,47,47,47,47,47)  		  		
  		);

$v_mobs[6]=array(
  "lab" => 0,
  "group_level"=>8, // уровневая группа  
  "min_level" =>8,
  "max_level" =>8,
  "master_bot" =>47,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(47,47,47,47,47,47,47,47,47,47,48,48,48,48,48,48,48,48,48,48)  	  		
  		);

$v_mobs[7]=array(
  "lab" => 0,
  "group_level"=>8, // уровневая группа  
  "min_level" =>8,
  "max_level" =>8,
  "master_bot" =>48,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(48,48,48,48,48,48,48,48,48,48,49,49,49,49,49,49,49,49,49,49)  		  		
  		);

  		
$v_mobs[18]=array(
  "lab" => 0,
  "group_level"=>12, // уровневая группа  
  "min_level" =>12,
  "max_level" =>12,
  "master_bot" =>59,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59)        
    );  		
  		
$v_mobs[9]=array(
  "lab" => 0,
  "group_level"=>9, // уровневая группа  
  "min_level" =>9,
  "max_level" =>9,
  "master_bot" =>50,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(50,50,50,50,50,50,50,50,50,50,51,51,51,51,51,51,51,51,51,51)  		  		
  		);

$v_mobs[10]=array(
  "lab" => 0,
  "group_level"=>9, // уровневая группа  
  "min_level" =>9,
  "max_level" =>9,
  "master_bot" =>51,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(51,51,51,51,51,51,51,51,51,51,52,52,52,52,52,52,52,52,52,52)   		  		
  		);

$v_mobs[11]=array(
  "lab" => 0,
  "group_level"=>9, // уровневая группа  
  "min_level" =>9,
  "max_level" =>9,
  "master_bot" =>52,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(52,52,52,52,52,53,52,52,52,52,52,52,52,52,52,52,53,52,52,52,52,52)  		  		
  		);

$v_mobs[12]=array(
  "lab" => 0,
  "group_level"=>10, // уровневая группа  
  "min_level" =>10,
  "max_level" =>10,
  "master_bot" =>53,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(53,53,53,53,53,53,53,53,53,53,54,54,54,54,54,54,54,54,54,54)  		  		
  		);

$v_mobs[13]=array(
  "lab" => 0,
  "group_level"=>10, // уровневая группа  
  "min_level" =>10,
  "max_level" =>10,
  "master_bot" =>54,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(54,54,54,54,54,54,54,54,54,54,55,55,55,55,55,55,55,55,55,55)  		  		
  		);

$v_mobs[14]=array(
  "lab" => 0,
  "group_level"=>10, // уровневая группа  
  "min_level" =>10,
  "max_level" =>10,
  "master_bot" =>55,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(55,55,55,55,55,55,55,55,55,55,56,56,56,56,56,56,56,56,56,56)  		  		
  		);

$v_mobs[15]=array(
  "lab" => 0,
  "group_level"=>10, // уровневая группа  
  "min_level" =>10,
  "max_level" =>10,
  "master_bot" =>56,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56,56)  		  		
  		);

$v_mobs[16]=array(
  "lab" => 0,
  "group_level"=>11, // уровневая группа  
  "min_level" =>11,
  "max_level" =>11,
  "master_bot" =>57,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(57,57,57,57,57,57,57,57,57,57,58,58,58,58,58,58,58,58,58,58)  		  		
  		);

$v_mobs[17]=array(
  "lab" => 0,
  "group_level"=>11, // уровневая группа  
  "min_level" =>11,
  "max_level" =>11,
  "master_bot" =>58,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(58,58,58,58,58,58,58,58,58,58,58,58,58,58,58,58,58,58,58,58)  		  		
  		);
  		
$v_mobs[18]=array(
  "lab" => 0,
  "group_level"=>12, // уровневая группа  
  "min_level" =>12,
  "max_level" =>12,
  "master_bot" =>59,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59,59)  		  		
  		);  		

$v_mobs[19]=array(
  "lab" => 0,
  "group_level"=>13, // уровневая группа  
  "min_level" =>13,
  "max_level" =>13,
  "master_bot" =>61,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(61,61,61,61,61,61,61,61,61,61,61,61,61,62,62,62,62,62,62,62,62)  		  		
  		);  	

$v_mobs[20]=array(
  "lab" => 0,
  "group_level"=>13, // уровневая группа  
  "min_level" =>13,
  "max_level" =>13,
  "master_bot" =>62,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(62,62,62,62,62,62,62,62,62,62,62,62,62,61,61,61,61,61,61,61,61,61,61)  		  		
  		);  	


$v_mobs[21]=array(
  "lab" => 0,
  "group_level"=>14, // уровневая группа  
  "min_level" =>14,
  "max_level" =>14,
  "master_bot" =>63,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(63,63,63,63,62,62,62,62,62,62)  		  		
  		);  


$v_mobs[22]=array(
  "lab" => 0,
  "group_level"=>14, // уровневая группа  
  "min_level" =>14,
  "max_level" =>14,
  "master_bot" =>64,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(64,64,64,64,62,62,62,62,62,62)  		  		
  		);  

$v_mobs[23]=array(
  "lab" => 0,
  "group_level"=>14, // уровневая группа  
  "min_level" =>14,
  "max_level" =>14,
  "master_bot" =>65,
  "room"=> array (20,66,21,26,50),  
  "bots"=> array(65,65,65,65,62,62,62,62,62,62)  		  		
  		);  


/// Фразы 
$bot_fr_activiti=1; // максимальное кол. фраз в минуту но не больше количества мастер ботов

$bot_mess= array (
"Сейчас всех зажарим и съедим!",
"Кепитал-сити будет сожжен. Да, да теперь это Дракон-сити.",
"Вы еще нашего самого большого дракона не видали.",
"Эй, людишки, разбегайтесь кто куда.",
"Да Вас и воинами назвать сложно. ",
"Каждый, кто не преклонит колено перед Драконом, будет убит.",
"Мы предлагаем Вам сдаться, взамен мы обещаем сохранить ваши жизни.",
"Самое страшное еще впереди!",
"За каждую смерть дракона мы отомстим, десятками смертей в этом городе.",
"Драконья семья вышла на охоту.",
"Скоро не останется никого в живых.",
"Всем зайти в инвентарь, снять все, и давайте в бой.",
"Ты себя со стороны видел? Прыгаешь вокруг меня как моська.",
"Разойдитесь, иду на аварийную посадку!!!",
"Посторонись, разойдись, зашибу!",
"Приведите мне самую красивую девушку в этом городе. Свататься буду.",
"Огнем не дышу, газ нынче дорогой.",
"Смертельный номер, вертикальный взлет!!!",
"Я повторяю, мы - не монстры! Мы эти... как их?... О! Водоплавающие!!!",
"Из дальнего края на зимовку прилетели!",
"Чуете, жареным запахло?!",
"Сколько народу собралось. Тебя на первое съедим, а тебя на второе…",
"Скучно с вами, пойду лучше полетаю.",
"Да прольётся кровь!",
"Я не падаю. Я атакую землю!",
"Почешите мне спинку, вам что сложно?");



?>
