<?php
	$login=htmlspecialchars($_GET['login']);
	$id=(int)($_GET['id']);
	if ($id>0) { unset($login); }


$rooms = array ("Секретная Комната","Комната для новичков","Комната для новичков 2","Комната для новичков 3","Комната для новичков 4","Зал Воинов 1","Зал Воинов 2","Зал Воинов 3","Торговый зал",
	"Рыцарский зал","Башня рыцарей-магов","Колдовской мир","Этажи духов","Астральные этажи","Огненный мир","Зал Паладинов","Совет Белого Братства","Зал Тьмы","Царство Тьмы","Будуар",
	"Центральная площадь","Страшилкина улица","Магазин","Ремонтная мастерская","Новогодняя елка","Комиссионный магазин","Парковая улица","Почта","Регистратура кланов","Банк","Суд",
	"Башня смерти","Готический замок","Лабиринт хаоса","Цветочный магазин","Магазин 'Березка'","Зал Стихий","Готический замок - приемная","Готический замок - арсенал","Готический замок - внутренний двор",
	"Готический замок - мастерские","Готический замок - комнаты отдыха","Лотерея Сталкеров","Комната Знахаря","Комната №44","Вход в Лабиринт Хаоса","Прокатная лавка","Арендная лавка","Храмовая лавка","Храм Древних","Замковая площадь",
	"Большая скамейка","Средняя скамейка","Маленькая скамейка","Зал Света","Царство Света","Царство Стихий","Зал клановых войн","Комната №58","Комната №59","Арена Богов","Комната №61","Комната №62","Комната №63","Комната №64","Комната №65","66"=>'Торговая улица',
"200"=> "Ристалище","401"=> "Врата Ада",


//Ломбард
"70" => "Ломбард",
"71" => "Аукцион",
//турниры

"197"=>"Оружейная Комната",
"198"=>"Оружейная Комната",
"199"=>"Оружейная Комната",

"210"=>"Вход в Одиночные сражения",
"211"=> "Одиночные сражения[1]",
"212"=> "Одиночные сражения[2]",
"213"=> "Одиночные сражения[3]",
"214"=> "Одиночные сражения[4]",
"215"=> "Одиночные сражения[5]",
"216"=> "Одиночные сражения[6]",
"217"=> "Одиночные сражения[7]",
"218"=> "Одиночные сражения[8]",
"219"=> "Одиночные сражения[9]",
"220"=> "Одиночные сражения[10]",
"221"=> "Одиночные сражения[11]",
"222"=> "Одиночные сражения[12]",
// Групповое сражение
"240"=>"Вход в Групповое сражения",
"241"=> "Групповое сражение[1]",
"242"=> "Групповое сражение[2]",
"243"=> "Групповое сражение[3]",
"244"=> "Групповое сражение[4]",
"245"=> "Групповое сражение[5]",
"246"=> "Групповое сражение[6]",
"247"=> "Групповое сражение[7]",
"248"=> "Групповое сражение[8]",
"249"=> "Групповое сражение[9]",
"250"=> "Групповое сражение[10]",
"251"=> "Групповое сражение[11]",
"252"=> "Групповое сражение[12]",
"253"=> "Групповое сражение[13]",
//Сражение отрядов
"270"=>"Вход в Сражение отрядов",
"271"=> "Сражение отрядов[1]",
"272"=> "Сражение отрядов[2]",
"273"=> "Сражение отрядов[3]",
"274"=> "Сражение отрядов[4]",
"275"=> "Сражение отрядов[5]",
"276"=> "Сражение отрядов[6]",
"277"=> "Сражение отрядов[7]",
"278"=> "Сражение отрядов[8]",
"279"=> "Сражение отрядов[9]",
"280"=> "Сражение отрядов[10]",
"281"=> "Сражение отрядов[11]",
"282"=> "Сражение отрядов[12]",

// БС
"501" => "Восточная Крыша",
"502" => "Бойница",
"503" => "Келья 3",
"504" => "Келья 2",
"505" => "Западная Крыша 2",
"506" => "Келья 4",
"507" => "Келья 1",
"508" => "Служебная комната",
"509" => "Зал Отдыха 2",
"510" => "Западная Крыша 1",
"511" => "Выход на Крышу",
"512" => "Зал Статуй 2",
"513" => "Храм",
"514" => "Восточная комната",
"515" => "Зал Отдыха 1",
"516" => "Старый Зал 2",
"517" => "Старый Зал 1",
"518" => "Красный Зал 3",
"519" => "Зал Статуй 1",
"520" => "Зал Статуй 3",
"521" => "Трапезная 3",
"522" => "Зал Ожиданий",
"523" => "Оружейная",
"524" => "Красный Зал-Окна",
"525" => "Красный Зал",
"526" => "Гостинная",
"527" => "Трапезная 1",
"528" => "Внутренний Двор",
"529" => "Внутр.Двор-Вход",
"530" => "Желтый Коридор",
"531" => "Мраморный Зал 1",
"532" => "Красный Зал 2",
"533" => "Библиотека 1",
"534" => "Трапезная 2",
"535" => "Проход Внутр. Двора",
"536" => "Комната с Камином",
"537" => "Библиотека 3",
"538" => "Выход из Мрам.Зала",
"539" => "Красный Зал-Коридор",
"540" => "Лестница в Подвал 1",
"541" => "Южный Внутр. Двор",
"542" => "Трапезная 4",
"543" => "Мраморный Зал 3",
"544" => "Мраморный Зал 2",
"545" => "Картинная Галерея 1",
"546" => "Лестница в Подвал 2",
"547" => "Проход Внутр. Двора 2",
"548" => "Внутр.Двор-Выход",
"549" => "Библиотека 2",
"550" => "Картинная Галерея 3",
"551" => "Картинная Галерея 2",
"552" => "Лестница в Подвал 3",
"553" => "Терасса",
"554" => "Оранжерея",
"555" => "Зал Ораторов",
"556" => "Лестница в Подвал 4",
"557" => "Темная Комната",
"558" => "Винный Погреб",
"559" => "Комната в Подвале",
"560" => "Подвал" ,

"999" => "Вход в Руины"

);

if ($id>0)
	{
	
	$name=$id;
	}
else if ($login!='')
	{
	$name=$login;
	}	
	else
	{
	header ("content-type: text/xml");
	echo "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n";
	echo "<error>No input data</error>\n";
	die();
	}

$filename='/www/oldbk.com/api/_cache/'.$name.'.xml';
$file_ok=file_exists($filename);
$cache_time=60; 

if ($file_ok)
    {
    $file_stat=stat($filename);
    $file_mk_time=$file_stat[9];
    }

if ( ($file_ok) and ($file_mk_time+$cache_time)>=time())
{
//файл есть и актуальный
// выдаем его и все
header ("content-type: text/xml");
print file_get_contents($filename);
} else 
{
//файла нема или он просроченый делаем новый 
//1 ищем данные
   include "/www/oldbk.com/connect.php";
   if ($id>0)
   		{
		   $data=mysql_query("select *  from oldbk.users where id='".($id)."' ");
		  }
	else
		{
		   $data=mysql_query("select *  from oldbk.users where login='".mysql_real_escape_string($login)."' ");		   
		   
		}

   if (mysql_num_rows($data)>0)
   {
   $to_out="<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n";
   $to_out.="<clans_users refresh=\"".time()."\" >\n";
    	while($row=mysql_fetch_array($data))
	   {
	   $to_out.="<user id=\"{$row[id]}\">\n";
	   $to_out.="<login>".htmlspecialchars(strip_tags($row[login]))."</login>\n";
	   $to_out.="<level>".$row[level]."</level>\n";
	   $to_out.="<align>".$row[align]."</align>\n";
	   if ($row[status]!='') $to_out.="<status>".htmlspecialchars(strip_tags($row[status]))."</status>\n";	   
	   
	   if ($row[id_city]==0)
	   	{
		   $to_out.="<city>capitalcity</city>\n";
		 }
		 else
		 {
		   $to_out.="<city>avaloncity</city>\n";
		  }
	   
	   if (($row[odate] < (time()-60) )OR($row[hidden]>0))  
	   	 {
 		 $to_out.="<ingame>offline</ingame>\n";
		 if ($row[ldate]>0) 
		 				{ 
		 				if ($row[hidden]>0)
			 				{
			 				//$eff=mysql_fetch_array(mysql_query('select * from effects where owner='.$row['id'].' AND (type=200 OR type=202 ) LIMIT 1 ;'));
						 	//$row[ldate]=time()-(18000-($eff['time']-time()));
						 	$row[ldate]-=60;
						 	}
		 				
		 				$to_out.="<lasttime>".out_time_print($row[ldate])."</lasttime>\n";  
		 				
		 				}
	   	 } 
	   	 else 
	   	 {
		 $to_out.="<ingame>online</ingame>\n";
		 		
		 		if ($row['lab'] > 0 )
				{
					$rrm = 'Лабиринт Хаоса';
				}
				else if ($row['ruines'] > 0 )
				{
					$rrm = 'Руины';
				}
				else if ($row['in_tower'] ==10 )
				{
					$rrm = 'Башня смерти';
				}
				else if ($row['in_tower'] ==3 )
				{
					$rrm = 'Турниры:Сражение отрядов';
				}				
				else if ($user['room'] >= 49998 && $user['room'] <= 60000)
				{
				 	$rrm = 'Загород';
				} 
				else
				{
				$rrm = $rooms[$row['room']];
				}
		 $to_out.="<room>".$rrm."</room>\n";
		 
	   	 }
	   if (($row[battle]>0)and($row[hidden]==0))	   
	   		{
  				 $to_out.="<battle>".$row[battle]."</battle>\n";
	   		}
	   		else
	   		{
  				 $to_out.="<battle>0</battle>\n";
	   		}
	   		
	   $to_out.=" </user>\n";
	   }
   
	   
	   
    $to_out.="</clans_users>";	   
   }
   else
   {
   $cap_err='Персонаж не найден!';
   }
   
   
   
   
   
   if (!($cap_err))
   {
   //выдаем и сохраняем
   header ("content-type: text/xml");
   print $to_out;

	$fp = fopen ($filename,"w"); //открытие
	flock ($fp,LOCK_EX);
	fputs($fp,$to_out);
	fflush ($fp);
	flock ($fp,LOCK_UN);
	fclose ($fp);
   }
   else 
   {
	header ("content-type: text/xml");
	echo "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n";
	echo "<error>User not found</error>\n";
	die();
   }

}

function out_time_print($eff)
		{
	$tt=time();
	$time_still=$tt-$eff;

	$tmp = floor($time_still/2592000);
	$id=0; // сколько значений показывать
	if ($tmp > 0) {
		$id++;
		if ($id<3) {$out .= $tmp." мес. ";}
		$time_still = $time_still-$tmp*2592000;
	}
	$tmp = floor($time_still/604800);
	if ($tmp > 0) {
		$id++;
		if ($id<3) {$out .= $tmp." нед. ";}
		$time_still = $time_still-$tmp*604800;
	}
	$tmp = floor($time_still/86400);
	if ($tmp > 0) {
		$id++;
		if ($id<3) {$out .= $tmp." дн. ";}
		$time_still = $time_still-$tmp*86400;
	}
	$tmp = floor($time_still/3600);
	if ($tmp > 0) {
		$id++;
		if ($id<3) {$out .= $tmp." ч. ";}
		$time_still = $time_still-$tmp*3600;
	}
	$tmp = floor($time_still/60);
	if ($tmp > 0) {
		$id++;
		if ($id<3) {$out .= $tmp." мин. ";}
	}
	if ($out=='')  {$out='меньше минуты';}
	return $out;
}

?>
