<?php
$rooms = array (
"31" => "Башня смерти",
"501" => "Восточная Крыша",
"502" => "Бойница",
"503" => "Келья 3",
"504" => "Келья 2",
"505" => "Западная Крыша 2",
"506" => "Келья 4",
"507" => "Келья 1",
"508" => "Служебная комната",
"509" => "Зал Отдыха 2",
"510" => "Западная Крыша 1",
"511" => "Выход на Крышу",
"512" => "Зал Статуй 2",
"513" => "Храм",
"514" => "Восточная комната",
"515" => "Зал Отдыха 1",
"516" => "Старый Зал 2",
"517" => "Старый Зал 1",
"518" => "Красный Зал 3",
"519" => "Зал Статуй 1",
"520" => "Зал Статуй 3",
"521" => "Трапезная 3",
"522" => "Зал Ожиданий",
"523" => "Оружейная",
"524" => "Красный Зал-Окна",
"525" => "Красный Зал",
"526" => "Гостинная",
"527" => "Трапезная 1",
"528" => "Внутренний Двор",
"529" => "Внутр.Двор-Вход",
"530" => "Желтый Коридор",
"531" => "Мраморный Зал 1",
"532" => "Красный Зал 2",
"533" => "Библиотека 1",
"534" => "Трапезная 2",
"535" => "Проход Внутр. Двора",
"536" => "Комната с Камином",
"537" => "Библиотека 3",
"538" => "Выход из Мрам.Зала",
"539" => "Красный Зал-Коридор",
"540" => "Лестница в Подвал 1",
"541" => "Южный Внутр. Двор",
"542" => "Трапезная 4",
"543" => "Мраморный Зал 3",
"544" => "Мраморный Зал 2",
"545" => "Картинная Галерея 1",
"546" => "Лестница в Подвал 2",
"547" => "Проход Внутр. Двора 2",
"548" => "Внутр.Двор-Выход",
"549" => "Библиотека 2",
"550" => "Картинная Галерея 3",
"551" => "Картинная Галерея 2",
"552" => "Лестница в Подвал 3",
"553" => "Терасса",
"554" => "Оранжерея",
"555" => "Зал Ораторов",
"556" => "Лестница в Подвал 4",
"557" => "Темная Комната",
"558" => "Винный Погреб",
"559" => "Комната в Подвале",
"560" => "Подвал"

);

	if (!($_SESSION['uid'] >0)) header("Location: index.php");

	$chanse = 80+$user['intel'];

	if ($user['ruines']) {
		require_once('/www/capitalcity.oldbk.com/ruines_rooms.php');
		// руины
		$q = mysql_query('SELECT * FROM ruines_items WHERE type = 1 AND room = '.$user['room']) or die();
		if (mysql_num_rows($q) > 0) {
			echo "<font color=red><b>В этой комнате уже есть ловушка!<b></font>";
		} else {
			if($user['intel'] >= 8) {
				if(rand(1,100) <= $chanse) {
					# ok, 
					if ($user['sex'] == 1) {$action="установил";}
					else {$action="установила";}

					$du=(int)($user[room]*0.01);
					$du=$du*100;
					$user_room=$user[room]-$du;
					$komnata = $rooms[$user_room][0];
					//$messch="Персонаж &quot;{$user['login']}&quot; $action ловушку в этой комнате...";
					//addch("<img src=i/magic/trap.gif> $messch");		
					echo "<font color=red><b>Вы установили ловушку в ''{$komnata}''</b></font>";	
					mysql_query('INSERT INTO `ruines_items` (type,name,img,room,extra) VALUES ("1","Ловушка","",'.$user['room'].','.$user['id'].')') or die();
					$bet=1;			
					$sbet = 1;
				} else {
					# сгорел
					echo "<font color=red><b>Свиток рассыпался в ваших руках...<b></font>";
					$bet = 1;
				}
			}else {
				echo "<font color=red><b>Недостаточно интелекта..<b></font>";
			}
		}
	} else {
		// БС	
		
		$tar = mysql_fetch_array(mysql_query("select id from deztow_trap where room='{$user[room]}'")); 
		if ($tar['id']) {
 			echo "<font color=red><b>В этой комнате уже есть ловушка!<b></font>";
		}
		else {
			if($user[intel]>=8) {
				if(rand(1,100) <= $chanse) {
					# ok, 
					if ($user['sex'] == 1) {$action="установил";}
					else {$action="установила";}
					$komnata = $rooms[$user['room']];
					//$messch="Персонаж &quot;{$user['login']}&quot; $action ловушку в этой комнате...";
					//addch("<img src=i/magic/trap.gif> $messch");		
					echo "<font color=red><b>Вы установили ловушку в ''{$komnata}''</b></font>";	
					mysql_query("INSERT INTO deztow_trap VALUES (NULL, '{$user[id]}', '{$user[room]}')");
					$bet=1;			
					$sbet = 1;
				} else {
					# сгорел
					echo "<font color=red><b>Свиток рассыпался в ваших руках...<b></font>";
					$bet = 1;
				}
			}else {
				echo "<font color=red><b>Недостаточно интелекта..<b></font>";
			}
		}
	}
?>
