<?
// API  - лицензии
//header ("content-type: text/xml");

$city_pref='oldbk.';
$city_id='0';

//без лимита

echo "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n";
include "/www/oldbk.com/connect.php";
$rooms = array ("Секретная Комната","Комната для новичков","Комната для новичков 2","Комната для новичков 3","Комната для новичков 4","Зал Воинов 1","Зал Воинов 2","Зал Воинов 3","Торговый зал",
	"Рыцарский зал","Башня рыцарей-магов","Колдовской мир","Этажи духов","Астральные этажи","Огненный мир","Зал Паладинов","Совет Белого Братства","Зал Тьмы","Царство Тьмы","Будуар",
	"Центральная площадь","Страшилкина улица","Магазин","Ремонтная мастерская","Новогодняя елка","Комиссионный магазин","Парковая улица","Почта","Регистратура кланов","Банк","Суд",
	"Башня смерти","Готический замок","Лабиринт хаоса","Цветочный магазин","Магазин 'Березка'","Зал Стихий","Готический замок - приемная","Готический замок - арсенал","Готический замок - внутренний двор",
	"Готический замок - мастерские","Готический замок - комнаты отдыха","Лотерея Сталкеров","Комната Знахаря","Комната №44","Вход в Лабиринт Хаоса","Прокатная лавка","Арендная лавка","Храмовая лавка","Храм Древних","Замковая площадь",
	"Большая скамейка","Средняя скамейка","Маленькая скамейка","Зал Света","Царство Света","Царство Стихий","Зал клановых войн","Комната №58","Комната №59","Арена Богов","Комната №61","Комната №62","Комната №63","Комната №64","Комната №65","66"=>'Торговая улица',
"200"=> "Ристалище","401"=> "Врата Ада",

//Ломбард
"70" => "Ломбард",
"71" => "Аукцион",
//турниры

"197"=>"Оружейная Комната",
"198"=>"Оружейная Комната",
"199"=>"Оружейная Комната",

"270"=>"Вход в Одиночные сражения",
"271"=> "Одиночные сражения[1]",
"272"=> "Одиночные сражения[2]",
"273"=> "Одиночные сражения[3]",
"274"=> "Одиночные сражения[4]",
"275"=> "Одиночные сражения[5]",
"276"=> "Одиночные сражения[6]",
"277"=> "Одиночные сражения[7]",
"278"=> "Одиночные сражения[8]",
"279"=> "Одиночные сражения[9]",
"280"=> "Одиночные сражения[10]",
"281"=> "Одиночные сражения[11]",
"282"=> "Одиночные сражения[12]",
// Групповое сражение
"240"=>"Вход в Групповое сражения",
"241"=> "Групповое сражение[1]",
"242"=> "Групповое сражение[2]",
"243"=> "Групповое сражение[3]",
"244"=> "Групповое сражение[4]",
"245"=> "Групповое сражение[5]",
"246"=> "Групповое сражение[6]",
"247"=> "Групповое сражение[7]",
"248"=> "Групповое сражение[8]",
"249"=> "Групповое сражение[9]",
"250"=> "Групповое сражение[10]",
"251"=> "Групповое сражение[11]",
"252"=> "Групповое сражение[12]",
//Сражение отрядов
"210"=>"Вход в Сражение отрядов",
"211"=> "Сражение отрядов[1]",
"212"=> "Сражение отрядов[2]",
"213"=> "Сражение отрядов[3]",
"214"=> "Сражение отрядов[4]",
"215"=> "Сражение отрядов[5]",
"216"=> "Сражение отрядов[6]",
"217"=> "Сражение отрядов[7]",
"218"=> "Сражение отрядов[8]",
"219"=> "Сражение отрядов[9]",
"220"=> "Сражение отрядов[10]",
"221"=> "Сражение отрядов[11]",
"222"=> "Сражение отрядов[12]",

// БС
"501" => "Восточная Крыша",
"502" => "Бойница",
"503" => "Келья 3",
"504" => "Келья 2",
"505" => "Западная Крыша 2",
"506" => "Келья 4",
"507" => "Келья 1",
"508" => "Служебная комната",
"509" => "Зал Отдыха 2",
"510" => "Западная Крыша 1",
"511" => "Выход на Крышу",
"512" => "Зал Статуй 2",
"513" => "Храм",
"514" => "Восточная комната",
"515" => "Зал Отдыха 1",
"516" => "Старый Зал 2",
"517" => "Старый Зал 1",
"518" => "Красный Зал 3",
"519" => "Зал Статуй 1",
"520" => "Зал Статуй 3",
"521" => "Трапезная 3",
"522" => "Зал Ожиданий",
"523" => "Оружейная",
"524" => "Красный Зал-Окна",
"525" => "Красный Зал",
"526" => "Гостинная",
"527" => "Трапезная 1",
"528" => "Внутренний Двор",
"529" => "Внутр.Двор-Вход",
"530" => "Желтый Коридор",
"531" => "Мраморный Зал 1",
"532" => "Красный Зал 2",
"533" => "Библиотека 1",
"534" => "Трапезная 2",
"535" => "Проход Внутр. Двора",
"536" => "Комната с Камином",
"537" => "Библиотека 3",
"538" => "Выход из Мрам.Зала",
"539" => "Красный Зал-Коридор",
"540" => "Лестница в Подвал 1",
"541" => "Южный Внутр. Двор",
"542" => "Трапезная 4",
"543" => "Мраморный Зал 3",
"544" => "Мраморный Зал 2",
"545" => "Картинная Галерея 1",
"546" => "Лестница в Подвал 2",
"547" => "Проход Внутр. Двора 2",
"548" => "Внутр.Двор-Выход",
"549" => "Библиотека 2",
"550" => "Картинная Галерея 3",
"551" => "Картинная Галерея 2",
"552" => "Лестница в Подвал 3",
"553" => "Терасса",
"554" => "Оранжерея",
"555" => "Зал Ораторов",
"556" => "Лестница в Подвал 4",
"557" => "Темная Комната",
"558" => "Винный Погреб",
"559" => "Комната в Подвале",
"560" => "Подвал" ,
"999" => "Вход в Руины"

);





$get_all_data=mysql_query("select u.id, u.login, u.level, u.room, u.sex, u.align, u.klan, u.battle, u.id_city, u.odate,  u.in_tower, u.lab, u.ruines, e.name, e.type, e.time from users u LEFT JOIN effects e on u.id =e.owner where e.type in (2000,30000,40000,50000)  and  u.odate >=".(time()-120)."  order by e.type ");


$all_count=mysql_num_rows($get_all_data);

echo "<online refresh=\"".time()."\">";

while($u_data = mysql_fetch_array($get_all_data)) 
	{
	echo "<user id=\"".$u_data[id]."\" ";
	echo "login=\"".$u_data[login]."\" ";
	echo "sex=\"".$u_data[sex]."\" ";

	echo "level=\"".$u_data[level]."\" ";
	echo "align=\"".$u_data[align]."\" ";
	echo "klan=\"".$u_data[klan]."\" ";

	echo "battle=\"".$u_data[battle]."\" ";


	if ($u_data[lab]>0)
	{
		$lab[1]='Лабиринт Хаоса - обычный';
		$lab[2]='Лабиринт Хаоса - героический';		
		$lab[3]='Лабиринт Хаоса - новичков';				
		echo "loc=\"".$lab[$u_data[lab]]."\" ";			
	}
	else
	  if ($u_data[ruines] > 0)
	   {
	   	echo "loc=\"Руины\" trunir=\"".$u_data[ruines]."\" ";			
	   }
	else 
	  if  ($u_data[in_tower]==10)
	  { 
	  echo "loc=\"Башня смерти\" ";
	  }
	else 
	  if  ($u_data[in_tower]==3)
	  { 
	  echo "loc=\"Турниры:Одиночные сражения\" trunir=\"".$u_data[id_grup]."\" ";
	  }	  
	 else
	 if ($user['room'] >= 49998 && $user['room'] <= 60000)
	 {
	 echo "loc=\"Загород\" ";
	 } 
	else
	 {
	 echo "loc=\"".$rooms[$u_data[room]]."\" ";
	 }
	$city_name[0]="Capitalcity";
	$city_name[1]="AvalonCity";	
	echo "id_city=\"".$city_name[$u_data[id_city]]."\" ";	
		


//	echo "slp=\"".$u_data[slp]."\" ";

	echo "odate=\"".$u_data[odate]."\" ";



 	echo ">\n";  	 
 	echo "<license>";

	echo "license_name=\"".$u_data['name']."\" ";
	echo "license_time_off=\"".$u_data['time']."\" ";				
 	echo "</license>\n";

 	
 	echo "</user>\n"; 
	 
	}

echo "</online>";

?>