<?php
/**
 * Created by PhpStorm.
 * User: me
 * Date: 12.05.17
 * Time: 12:23
 */

return array(
	/*'0' => [
		'title' => 'Отказаться от класса',
		'desc' 	=> 'на время тестирования классовых боев вы можете отказаться от класса и вернуться к привычному формату боев. После завершения тестирования классов всем персонажам будет необходимо выбрать один из трех вышеуказанных классов.',
		'img' 	=> 'http://i.oldbk.com/i/empty.png',
	],*/
	'1' => [
		'title' => 'Уворотчик',
		'desc' 	=> 'представители этого класса предпочитают осторожную тактику боя. Низкий урон оружия с лихвой компенсируется частыми попаданиями, а повышенные модификаторы уворота позволяют воинам этого класса продолжительное время избегать прямых попаданий атак противника.',
		'img' 	=> 'https://i.oldbk.com/i/classes/vert.gif',
	],
	'2' => [
		'title' => 'Критовик',
		'desc' 	=> 'этот класс рекомендуется воинам, предпочитающим быстрые и жестокие поединки. Двойной урон при критическом попадании позволяет представителям этого класса уверенно и планомерно уничтожать даже бронированных противников.',
		'img' 	=> 'https://i.oldbk.com/i/classes/krit.gif',
	],
	'3' => [
		'title' => 'Танк',
		'desc' 	=> 'благодаря толстой броне и высоким значениям НР персонажи этого класса как правило являются основной сдерживающей силой и способны в одиночку противостоять нескольким противникам. Из-за невероятной живучести этот класс наиболее предпочтителен для начинающих бойцов.',
		'img' 	=> 'https://i.oldbk.com/i/classes/tank.gif',
	],
);