<?php
/**
 * Created by PhpStorm.
 * User: me
 * Date: 12.05.17
 * Time: 12:23
 */

return array(
	'1' => [
		'title' => 'ћаги€ огн€',
		'desc' 	=> 'при удачном попадании, эффекты этой стихии создают дополнительный "ожог" у противника. —ила ожога зависит от количества умений в магии огн€.',
		'img' 	=> 'https://i.oldbk.com/i/infoicon_fire.png',
	],
	'2' => [
		'title' => 'ћаги€ земли',
		'desc' 	=> 'при удачном попадании, эффекты этой стихии создают дополнительный "подлый удар" по всем живым противникам. —ила удара зависит от количества умений в магии земли.',
		'img' 	=> 'https://i.oldbk.com/i/infoicon_ground.png',
	],
	'3' => [
		'title' => 'ћаги€ воздуха',
		'desc' 	=> 'при удачном попадании, эффекты этой стихии создают дополнительное "потр€сение" у противника и трех бойцов из его команды рандомно (+- уровень от нанос€щего удар). —ила потр€сени€ зависит от количества умений в магии воздуха.',
		'img' 	=> 'https://i.oldbk.com/i/infoicon_air.png',
	],
	'4' => [
		'title' => 'ћаги€ воды',
		'desc' 	=> 'при удачном попадании, эффекты этой стихии создают дополнительное "отравление" у противника и, возможно, у некоторых бойцов его команды. —ила отравлени€ зависит от количества умений в магии воды.',
		'img' 	=> 'https://i.oldbk.com/i/infoicon_water.png',
	],
);