<?php

return [
	"captcha_is_not_set"		=> "Вы не ввели защитный код !",
	"password_is_was_sent"		=> "Сегодня пароль уже высылался. Проверьте почту.",
	"email_not_found"			=> "У Персонажа :login не указан email!",
	"password_error"			=> "К сожалению мы не можем выслать Ваш пароль, для смены пароля свяжитесь с Администрацией!",
	"user_not_found"			=> "Персонаж :login не найден!",
	"deny_user"					=> "Нелья выслать пароль этого персонажа",

	"loginid.required"			=> "Введите логин персонажа!",
	"loginid.min"				=> "Логин может содержать от 4 символов",
	"loginid.max"				=> "Логин может содержать до 20 символов",

	"email.subject"				=> "Восстановление пароля на oldbk.com, для пользователя - :login",
	"email.success"				=> "Пароль отправлен Вам на почту :hidden_mail",
];
